{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Ecco", "subtitle": "One American's Mission to Rescue Victims of the 20th Century's First Genocide", "description": "A bribe, a lie and an empty threat—these were the tools Reverend Asa K. Jennings used to rescue hundreds of thousands of helpless refugees following the 1922 burning of Smyrna, the richest and most cosmopolitan city of the Ottoman Empire. A minister from upstate New York, Jennings had arrived in Smyrna just as the final territorial dispute of World War I was being settled in a brutal war between the army of Greece and a force of Turkish rebels—fighting as proxies for WWI's European victors who had been unable to impose a treaty on the defeated Ottoman Empire. Hundreds of thousands of terrified Greek and Armenian refugees fled to Smyrna as Mustapha Kemal (known today as Ataturk) and his Moslem army advanced on the mostly Christian city. The Turkish soldiers set fire to the city and raped and killed countless Christian refugees while French, British, Italian, and American warships, under strict orders to remain neutral, stood immobile in the harbor. The Great Fire tells the harrowing and inspiring story of Jennings and a strong-willed naval officer, Lt. Commander Halsey Powell, who together orchestrated one of the century's greatest humanitarian missions. Emboldened by his religious faith, Jennings worked tirelessly to feed and transport the thousands of desperate people while Powell, a war hero and Kentucky gentleman, skirted orders so that he could bring America's Navy to the rescue. By the time the horrible events in Turkey had ended, Jennings and Powell had helped rescue almost a million refugees. Drawing extensively from survivors' stories, fresh primary sources, and years of research, Ureneck has painted an unforgettable portrait of the fire at Smyrna—the symbolic end of five hundred years of Ottoman rule and the final act in a ten-year religious slaughter. This gripping narrative reveals forces that would define the rest of the century: virulent nationalism, trading oil for national principles, and conflict and misunderstanding between the Christian West and Moslem East. This is an astonishing look at a pivotal, but little known, moment in our history viewed through the lens of the hopeful story of two men who faced a savage crisis with an unshakeable decency.", "language": "en", "publishedDate": "2015-05-12", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=lOWuoQEACAAJ&dq=isbn:0062259881&hl=&cd=1&source=gbs_api", "title": "The Great Fire", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/The_Great_Fire.html?hl=&id=lOWuoQEACAAJ", "pageCount": 512, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "0062259881", "type": "ISBN_10"}, {"identifier": "9780062259882", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=lOWuoQEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=lOWuoQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Lou Ureneck"], "ratingsCount": 7, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=lOWuoQEACAAJ&dq=isbn:0062259881&hl=&source=gbs_api", "categories": ["History"], "averageRating": 4.0}, "searchInfo": {"textSnippet": "This is an astonishing look at a pivotal, but little known, moment in our history viewed through the lens of the hopeful story of two men who faced a savage crisis with an unshakeable decency."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "VWUGj/1khAE", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=lOWuoQEACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "lOWuoQEACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/lOWuoQEACAAJ"}], "kind": "books#volumes"}