{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "McGraw-Hill Companies", "subtitle": "Treatment and Reuse", "description": "Wastewater Engineering: Treatment and Reuse4/e is an update of McGraw-Hill's popular book on wastewater treatment for civil and environmental engineering majors. It describes the technological and regulatory changes that have occurred over the last ten years in this discipline, including: Improved techniques for the characterization of wastewaters. Improved fundamental understanding of many of the existing unit operations and processes used for wastewater treatment, especially those processes used for the biological removal of nutrients. Greater implementation of several newer treatment technologies (e.g., UV disinfection, membrane filtration, and heat drying). Greater concern for the long term health and environmental impacts of wastewater constituents. Greater emphasis on advanced wastewater treatment and risk assessment for water reuse applications. Changes in regulations and the development of new technologies for wastewater disinfection. New regulations governing the treatment, reuse, and disposal of sludge (biosolids). Greater concern for infrastructure renewal including upgrading the design and performance of wastewater treatment plants.This revision contains a strong focus on advanced wastewater treatment technologies and stresses the reuse aspects of wastewater and biosolids.Theory and design issues are now integrated in the chapters on physical, chemical, and biological operations and processes. Combining this material presents a more unified approach to the subjects, and eliminates redundancies that appeared in the third edition. Chapters covering the theory and design of biological treatment systems have been expanded significantly.SI units are now the lead units, reflecting the global approach to wastewater engineering as it is taught in universities and presented in technical journals. This change addresses the volume of work being done by US consultants overseas, and supports the needs of engineering professionals outside the US for a comprehensive reference source.This edition retains the strengths of the previous edition by including many data tables. Data tables have been thoroughly updated, and approximately 40 new data tables have been added. Several new design examples have been added, reflecting the technological changes in process design that have occurred. Many new photos of facilities and equipment are included as well.This is the bible of wastewater engineering. No civil or environmental engineering majors or environmental engineering professional should be without this book on his or her shelf.", "language": "en", "publishedDate": "2003", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=_iBSAAAAMAAJ&dq=isbn:0070418780&hl=&cd=1&source=gbs_api", "title": "Wastewater Engineering", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Wastewater_Engineering.html?hl=&id=_iBSAAAAMAAJ", "pageCount": 1819, "maturityRating": "NOT_MATURE", "contentVersion": "0.2.1.0.preview.0", "industryIdentifiers": [{"identifier": "UOM:39015054460871", "type": "OTHER"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=_iBSAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=_iBSAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["George Tchobanoglous", "Franklin Louis Burton", "H. David Stensel"], "ratingsCount": 7, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=_iBSAAAAMAAJ&dq=isbn:0070418780&hl=&source=gbs_api", "categories": ["Technology & Engineering"], "averageRating": 4.0}, "searchInfo": {"textSnippet": "Several new design examples have been added, reflecting the technological changes in process design that have occurred. Many new photos of facilities and equipment are included as well.This is the bible of wastewater engineering."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "SuEFRnkAfio", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=_iBSAAAAMAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "_iBSAAAAMAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/_iBSAAAAMAAJ"}], "kind": "books#volumes"}