{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "McGraw-Hill Professional", "description": "Fundamentals of Digital Logic With VHDL Design teaches the basic design techniques for logic circuits. It emphasizes the synthesis of circuits and explains how circuits are implemented in real chips. Fundamental concepts are illustrated by using small examples, which are easy to understand. Then, a modular approach is used to show how larger circuits are designed. VHDL is used to demonstrate how the basic building blocks and larger systems are defined in a hardware description language, producing designs that can be implemented with modern CAD tools. The book emphasizes the concepts that should be covered in an introductory course on logic design, focusing on: Logic functions, gates, and rules of Boolean algebra Circuit synthesis and optimization techniques Number representation and arithmetic circuits Combinational-circuit building blocks, such as multiplexers, decoders, encoders, and code converters Sequential-circuit building blocks, such as flip-flops, registers, and counters Design of synchronous sequential circuits Use of the basic building blocks in designing larger systems It also includes chapters that deal with important, but more advanced topics: Design of asynchronous sequential circuits Testing of logic circuits For students who have had no exposure to basic electronics, but are interested in learning a few key concepts, there is a chapter that presents the most basic aspects of electronic implementation of digital circuits. Major changes in the second edition of the book include new examples to clarify the presentation of fundamental concepts over 50 new examples of solved problems provided at the end of chapters NAND and NOR gates now introduced in Chapter 2 more complete discussion of techniques for minimization of logic functions in Chapter 4 (including the tabular method) a new chapter explaining the CAD flow for synthesis of logic circuits Altera's Quartus II CAD software provided on a CD-ROM three appendices that give tutorials on the use of Quartus II software", "language": "en", "publishedDate": "2004-07", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=Oygh3IDUTgsC&dq=isbn:0072499389&hl=&cd=1&source=gbs_api", "title": "Fundamentals of Digital Logic with VHDL Design", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Fundamentals_of_Digital_Logic_with_VHDL.html?hl=&id=Oygh3IDUTgsC", "pageCount": 939, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "0072499389", "type": "ISBN_10"}, {"identifier": "9780072499384", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=Oygh3IDUTgsC&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Oygh3IDUTgsC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Stephen D. Brown", "Stephen Brown", "Zvonko G. Vranesic", "Zvonko Vranesic"], "ratingsCount": 7, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=Oygh3IDUTgsC&dq=isbn:0072499389&hl=&source=gbs_api", "categories": ["Computers"], "averageRating": 4.0}, "searchInfo": {"textSnippet": "The book emphasizes the concepts that should be covered in an introductory course on logic design, focusing on: Logic functions, gates, and rules of Boolean algebra Circuit synthesis and optimization techniques Number representation and ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "laYX6uDzbhs", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=Oygh3IDUTgsC&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "Oygh3IDUTgsC", "selfLink": "https://www.googleapis.com/books/v1/volumes/Oygh3IDUTgsC"}], "kind": "books#volumes"}