{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "McGraw Hill Professional", "description": "The seventh edition ofMechanical Engineering Designmarks a return to the basic approaches that have made this book the standard in machine design for over 40 years. At the same time it has been significantly updated and modernized for today's engineering students and professional engineers. Working from extensive market research and reviews of the 6th edition, the new 7th edition features reduced coverage of uncertainty and statistical methods. Statistics is now treated (in chapter 2) as one of several methods available to design engineers, and statistical applications are no longer integrated throughout the text, examples and problem sets. Other major changes include updated coverage of the design process, streamlined coverage of statistics, a more practical overview of materials and materials selection (moved to chapter 3),revised coverage of failure and fatigue, and review of basic strength of materials topics to make a clearer link with prerequisite courses. Overall coverage of basic concepts has been made more clear and concise, with some advanced topics deleted, so that readers can easily navigate key topics. Problem sets have been improved, with new problems added to help students progressively work through them. The book has an Online Learning Center with several powerful components: MATLAB for Machine Design (featuring highly visual MATLAB simulations and accompanying source code); the \"FEPC\" finite element program, with accompanying Finite Element Primer and FEM Tutorials; interactive FE Exam questions for Machine Design; and Machine Design Tutorials for study of key concepts from Parts I and II of the text. Complete Problem Solutions and PowerPoint slides of book illustrations are available for instructors, under password protection. A printed Instructor's Solutions Manual is also available, with detailed solutions to all chapter problems.", "language": "en", "publishedDate": "2003-07-01", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=A2mjQR6Nwn4C&dq=isbn:0072921935&hl=&cd=1&source=gbs_api", "title": "Mechanical Engineering Design", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Mechanical_Engineering_Design.html?hl=&id=A2mjQR6Nwn4C", "pageCount": 1030, "maturityRating": "NOT_MATURE", "contentVersion": "0.0.1.0.preview.0", "industryIdentifiers": [{"identifier": "0072921935", "type": "ISBN_10"}, {"identifier": "9780072921939", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=A2mjQR6Nwn4C&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=A2mjQR6Nwn4C&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Joseph Edward Shigley", "Charles R. Mischke", "Richard G. Budynas"], "ratingsCount": 12, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=A2mjQR6Nwn4C&dq=isbn:0072921935&hl=&source=gbs_api", "categories": ["Technology & Engineering"], "averageRating": 4.0}, "searchInfo": {"textSnippet": "The seventh edition ofMechanical Engineering Designmarks a return to the basic approaches that have made this book the standard in machine design for over 40 years."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "EKeDfM8+7Xg", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=A2mjQR6Nwn4C&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED_FOR_ACCESSIBILITY", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "A2mjQR6Nwn4C", "selfLink": "https://www.googleapis.com/books/v1/volumes/A2mjQR6Nwn4C"}], "kind": "books#volumes"}