{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Macmillan/McGraw-Hill School", "description": "The Sixth Edition of ADVANCED FINANCIAL ACCOUNTING, by Baker/Lembke/King continues its strong coverage of the topics, its well-known clarity of presentation, and its integrated coverage based on continuous case examples. The text is highly illustrated with complete presentations of worksheets, schedules, and financial statements so that students can see the development of each new topic.In the chapters covering consolidation subsequent to the date of combination, the three alternative methods of the parent company's accounting for the investment --basic equity, cost, and fully adjusted equity-- are presented in each chapter and appendices to provide the opportunity to cover the differences in the methods, and to see how the consolidated financial statements are the same regardless of the method the parent company uses to account for the investment. The two international chapters include a comprehensive discussion of accounting for foreign currency derivatives and other forms of derivatives such as interest swaps and options used in today's business arena. The governmental and not-for-profit chapters are comprehensive in their coverages of accounting and financial reporting for these entities, based on the most current GASB pronouncements.The text can be described as: (a) very comprehensive in coverage of advanced accounting topics, (b) extensively illustrated with worksheets and other learning tools, (c) clearly written for students' learning, (d) a very large variety of end-of-chapter materials for homework selections, and (e) current and complete in its coverage of accounting and reporting standards from the FASB and the GASB. Because Advanced Financial Accounting is often taken by students who plan to take the CPA exam, numerous end-of-chapter materials are provided in the formats as tested on the CPA exam. A wide variety of multiple-choice questions, cases requiring written presentations, and other objective answer format materials is provided.", "language": "en", "publishedDate": "2004-04-01", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=iVqePwAACAAJ&dq=isbn:0072977353&hl=&cd=1&source=gbs_api", "title": "Advanced Financial Accounting", "printType": "BOOK", "pageCount": 1142, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "0072977353", "type": "ISBN_10"}, {"identifier": "9780072977356", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=iVqePwAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=iVqePwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Richard E. Baker", "Valdean C. Lembke", "Thomas E. King"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=iVqePwAACAAJ&dq=isbn:0072977353&hl=&source=gbs_api", "categories": ["Business & Economics"], "canonicalVolumeLink": "http://books.google.com/books/about/Advanced_Financial_Accounting.html?hl=&id=iVqePwAACAAJ"}, "searchInfo": {"textSnippet": "The Sixth Edition of ADVANCED FINANCIAL ACCOUNTING, by Baker/Lembke/King continues its strong coverage of the topics, its well-known clarity of presentation, and its integrated coverage based on continuous case examples."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "8wYcffUmbK4", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=iVqePwAACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "iVqePwAACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/iVqePwAACAAJ"}], "kind": "books#volumes"}