{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "McGraw-Hill/Irwin", "description": "The authors began writing the First Edition of this textbook in early 1988. It took almost 10 years to complete this effort, because they did not want to write an ordinary textbook. Their goal was to write a book that would break new ground in both the understanding and explanation of finance and its practice. They wanted to write a book that would influence the way people think about, teach, and practice finance. A book that would elevate the level of discussion and analysis in the classroom, in the corporate boardroom, and in the conference rooms of Wall Street firms. They wanted a book that would sit on the shelves of financial executives as a useful reference manual, long after the executives had studied and received a degree. They were successful in their endeavor.The success of the first edition of Financial Markets and Corporate Strategy was very heartening. The market for this text has expanded every year, and it is well-known as the cutting edge textbook in corporate finance around the world. The book is used in a variety of courses, both for introductory courses and advanced electives. Some schools have even changed their curriculum to design it around this text.The authors have developed this Second Edition based on the comments of many reviewers and colleagues; producing what is a more reader-friendly book. The most consistent comment from users of the first edition was a request for a chapter on the key ingredients of valuation: accounting, cash flows, and basic discounting. This ultimately led to a new chapter in the text, Chapter 9, which is currently available in the \"Sample Chapter\" section of the book's website.In almost every chapter, examples are updated, vignettes changed, numbers modified, statements checked for currency and historical accuracy, and exercises and examples are either modified or added to. The goal of the Second Edition is to make the book ever more practical, pedagogically effective, and current.", "language": "en", "publishedDate": "2002", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=S1cPAQAAMAAJ&dq=isbn:0072294337&hl=&cd=1&source=gbs_api", "title": "Financial markets and corporate strategy", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Financial_markets_and_corporate_strategy.html?hl=&id=S1cPAQAAMAAJ", "pageCount": 880, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "0072294337", "type": "ISBN_10"}, {"identifier": "9780072294330", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=S1cPAQAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=S1cPAQAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Mark Grinblatt", "Sheridan Titman"], "ratingsCount": 1, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=S1cPAQAAMAAJ&dq=isbn:0072294337&hl=&source=gbs_api", "categories": ["Business & Economics"], "averageRating": 4.0}, "searchInfo": {"textSnippet": "The market for this text has expanded every year, and it is well-known as the cutting edge textbook in corporate finance around the world. The book is used in a variety of courses, both for introductory courses and advanced electives."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "xIjHrhtaT4k", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=S1cPAQAAMAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "S1cPAQAAMAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/S1cPAQAAMAAJ"}], "kind": "books#volumes"}