{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"subtitle": "a programmer's perspective", "description": "A PROGRAMMER'S PERSPECTIVE This book is for programmers who want to write faster and more reliable programs. By learning how programs are mapped onto the system and executed, readers will better understand why programs behave the way they do and how inefficiencies arise. Computer systems are viewed broadly, comprising processor and memory hardware, compiler, operating system, and networking environment. With its programmer's perspective, readers can clearly see how learning about the inner workings of computer systems will help their further development as computer scientists and engineers. It also helps prepare them for further study in computer architecture, operating systems, compilers, and networking. Topics include: data representations, machine-level representations of C programs, processor architecture, program optimization, memory hierarchy, linking, exceptional control flow, virtual memory and memory management, system-level 1/O, network programming, and concurrent programming. The coverage,focuses on how these areas affect application and system programmers. For example, when covering data representations, it considers how the finite representations used to represent numbers can approximate integer and real numbers, but with limitations that must be understood by programmers. When covering caching, it discusses how the ordering of loop indices in matrix code can affect program performance. When covering networking, it describes how a concurrent server can efficiently handle requests from multiple clients. The book is based on Intel-compatible (IA32) machines executing C programs on Unix or related operating systems such as Linux. Some familiarity with C or C++is assumed, although hints are included to help readers making the transition from Java to C. A complete set of resources, including labs and assignments, lecture notes, and code examples are available via the book's Web sit", "language": "en", "publishedDate": "2003", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=4n4ZAQAAIAAJ&dq=isbn:013034074X&hl=&cd=1&source=gbs_api", "title": "Computer systems", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Computer_systems.html?hl=&id=4n4ZAQAAIAAJ", "pageCount": 978, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "013034074X", "type": "ISBN_10"}, {"identifier": "9780130340740", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=4n4ZAQAAIAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=4n4ZAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Randal Bryant", "David Richard O'Hallaron"], "ratingsCount": 9, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=4n4ZAQAAIAAJ&dq=isbn:013034074X&hl=&source=gbs_api", "categories": ["Computers"], "averageRating": 4.0}, "searchInfo": {"textSnippet": "A PROGRAMMER&#39;S PERSPECTIVE This book is for programmers who want to write faster and more reliable programs."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "gkwzeepn3CI", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=4n4ZAQAAIAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "4n4ZAQAAIAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/4n4ZAQAAIAAJ"}], "kind": "books#volumes"}