{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"description": "THE definitive, authoritative book on DSP -- ideal for those with an introductory-level knowledge of signals and systems. Written by prominent, DSP pioneers, it provides thorough treatment of the fundamental theorems and properties of discrete-time linear systems, filtering, sampling, and discrete-time Fourier Analysis. By focusing on the general and universal concepts in discrete-time signal processing, it remains vital and relevant to the new challenges arising in the field -- \"without\" limiting itself to specific technologies with relatively short life spans. FEATURES NEW--Provides a new chapter organization. NEW--Material on: Multi-rate filtering banks. The discrete cosine transform. Noise-shaping sampling strategies. NEW--Includes several dozen new problem-solving examples that not only illustrate key points, but demonstrate approaches to typical problems related to the material. NEW--Contains a wealth of \"combat tested\" problems which are the best produced over decades of undergraduate and graduate signal processing classes at MIT and Georgia Tech. NEW--Problems are completely reorganized by level of difficulty into separate categories: Basic Problems with Answers to allow the user to check their results, but not solutions (20 per chapter). Basic Problems -- without answers. Advanced Problems. Extension Problems -- start from the discussion in the book and lead the reader beyond to glimpse some advanced areas of signal processing. Covers the history of discrete-time signal processing as well as contemporary developments in the field. Discusses the wide range of present and future applications of the technology. Focuses on the general and universal concepts in discrete-time signal processing. Offers a wealth of problems and examples.", "language": "en", "publishedDate": "1999", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=h_lSAAAAMAAJ&dq=isbn:0137549202&hl=&cd=1&source=gbs_api", "title": "Discrete-time Signal Processing", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Discrete_time_Signal_Processing.html?hl=&id=h_lSAAAAMAAJ", "pageCount": 870, "maturityRating": "NOT_MATURE", "contentVersion": "0.1.1.0.preview.0", "industryIdentifiers": [{"identifier": "0137549202", "type": "ISBN_10"}, {"identifier": "9780137549207", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=h_lSAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=h_lSAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Alan V. Oppenheim", "Ronald W. Schafer", "John R. Buck"], "ratingsCount": 6, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=h_lSAAAAMAAJ&dq=isbn:0137549202&hl=&source=gbs_api", "categories": ["Technology & Engineering"], "averageRating": 4.5}, "searchInfo": {"textSnippet": "THE definitive, authoritative book on DSP -- ideal for those with an introductory-level knowledge of signals and systems."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "Iz7UJyDkiFc", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=h_lSAAAAMAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "h_lSAAAAMAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/h_lSAAAAMAAJ"}], "kind": "books#volumes"}