{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Oxford University Press, USA", "description": "The Science and Engineering of Microelectronic Fabrication provides a thorough introduction to the field of microelectronic processing. Geared toward a wide audience, it may be used for upper-level undergraduate or first year graduate courses and as a handy reference for professionals. The text covers all the basic unit processes used to fabricate integrated circuits, including photolithography, plasma and reactive ion etching, ion implantation, diffusin, oxidation, evaporation, vapor phase epitaxial growth, sputtering, and chemical vapor deposition. Advanced processing topics such as rapid thermal processing, non-optical lithography, molecular beam epitaxy, and metal organic chemica vapor deposition are also presented. The physics and chemistry of each process is introduced along with descriptions of the equipment used for the manufacturing of integrated circuits. The text also discusses the itnegration of these processes into common technologies such as CMOS, double poly bipolar, and GaAs MESFETs. Complexity/performance tradeoffs are evaluated along with a description of the current state-of-the-art devices. Each chapter includes sample problems with solutions. The text makes use of the process simulation package SUPREM to demonstrate impurity profiles of practical interest. The new edition includes complete chapter coverage of MEMS including: Fundamentals of Mechanics, Stress in Thin Films, Mechanical to Electrical Transduction, Mechanics of Common MEMS Devices, Bulk Micromachining Etching Techniques, Bulk Micromachining Process Flow, Surface Micromachining Basics, Surface Micromachining Process Flow, MEMS Actuators, High Aspect Ratio Microsystems Technology (HARMST).", "language": "en", "publishedDate": "2001", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=J-YwRJx7ZQoC&dq=isbn:0195136055&hl=&cd=1&source=gbs_api", "title": "The Science and Engineering of Microelectronic Fabrication", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/The_Science_and_Engineering_of_Microelec.html?hl=&id=J-YwRJx7ZQoC", "pageCount": 603, "maturityRating": "NOT_MATURE", "contentVersion": "1.1.0.0.preview.0", "industryIdentifiers": [{"identifier": "0195136055", "type": "ISBN_10"}, {"identifier": "9780195136050", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=J-YwRJx7ZQoC&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=J-YwRJx7ZQoC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Stephen A. Campbell"], "ratingsCount": 1, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=J-YwRJx7ZQoC&dq=isbn:0195136055&hl=&source=gbs_api", "categories": ["Technology & Engineering"], "averageRating": 2.0}, "searchInfo": {"textSnippet": "The text covers all the basic unit processes used to fabricate integrated circuits, including photolithography, plasma and reactive ion etching, ion implantation, diffusin, oxidation, evaporation, vapor phase epitaxial growth, sputtering, ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "izBXPSOzUnI", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=J-YwRJx7ZQoC&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "J-YwRJx7ZQoC", "selfLink": "https://www.googleapis.com/books/v1/volumes/J-YwRJx7ZQoC"}], "kind": "books#volumes"}