{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Taylor & Francis US", "description": "Respected authors Phillip E. Allen and Douglas R. Holberg have combined their expertise as engineers and academics in this new edition of CMOS Analog Circuit Design. Including technological changes that have taken place since the first edition, this up-to-date work presents an effective overview of the principles and techniques for designing circuits to be implemented in CMOS technology. The two main goals of the text are to teach the methodology of analog integrated circuit design by using a hierarchically-organized approach and to mix the academic and practical viewpoints in a treatment that is neither superficial nor overly detailed. The industrial experience and knowledge of the authors have supplied many of the circuits, techniques, and principles presented in the book, making it a valuable resource for both practicing engineers and students taking courses in analog electronics or CMOS analog design. The trademark approach of Allen and Holberg's book is its design recipes, which take the reader step-by-step through the creation of real circuits, explaining and increasing understanding of complex design problems. The book provides detailed coverage of an often-neglected area and deliberately leaves out bipolar analog circuits, since CMOS is the dominant technology for analog integrated circuit design. Appropriate for seniors and graduate students with background knowledge in basic electronics including biasing, modeling, circuit, analysis and some familiarity with frequency response, CMOS Analog Circuit Design, Second Edition, presents a complete picture of design (including modeling, simulation, and testing) and enables readers to undertake the design of an analog circuit that can be implemented by CMOS technology.", "language": "en", "publishedDate": "2002-01", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=-crQYfNHJDUC&dq=isbn:0195116445&hl=&cd=1&source=gbs_api", "title": "CMOS Analog Circuit Design", "printType": "BOOK", "pageCount": 784, "maturityRating": "NOT_MATURE", "contentVersion": "0.0.1.0.preview.0", "industryIdentifiers": [{"identifier": "0195116445", "type": "ISBN_10"}, {"identifier": "9780195116441", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=-crQYfNHJDUC&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=-crQYfNHJDUC&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Phillip E. Allen", "Douglas R. Holberg"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=-crQYfNHJDUC&dq=isbn:0195116445&hl=&source=gbs_api", "categories": ["Computers"], "canonicalVolumeLink": "http://books.google.com/books/about/CMOS_Analog_Circuit_Design.html?hl=&id=-crQYfNHJDUC"}, "searchInfo": {"textSnippet": "Respected authors Phillip E. Allen and Douglas R. Holberg have combined their expertise as engineers and academics in this new edition of CMOS Analog Circuit Design."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "XO7SEBZBGVg", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=-crQYfNHJDUC&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "-crQYfNHJDUC", "selfLink": "https://www.googleapis.com/books/v1/volumes/-crQYfNHJDUC"}], "kind": "books#volumes"}