{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Addison Wesley", "description": "Considered a classic by many, A First Course in Abstract Algebra, Seventh Edition is an in-depth introduction to abstract algebra. Focused on groups, rings and fields, this text gives students a firm foundation for more specialized work by emphasizing an understanding of the nature of algebraic structures. Sets and Relations; GROUPS AND SUBGROUPS; Introduction and Examples; Binary Operations; Isomorphic Binary Structures; Groups; Subgroups; Cyclic Groups; Generators and Cayley Digraphs; PERMUTATIONS, COSETS, AND DIRECT PRODUCTS; Groups of Permutations; Orbits, Cycles, and the Alternating Groups; Cosets and the Theorem of Lagrange; Direct Products and Finitely Generated Abelian Groups; Plane Isometries; HOMOMORPHISMS AND FACTOR GROUPS; Homomorphisms; Factor Groups; Factor-Group Computations and Simple Groups; Group Action on a Set; Applications of G-Sets to Counting; RINGS AND FIELDS; Rings and Fields; Integral Domains; Fermat's and Euler's Theorems; The Field of Quotients of an Integral Domain; Rings of Polynomials; Factorization of Polynomials over a Field; Noncommutative Examples; Ordered Rings and Fields; IDEALS AND FACTOR RINGS; Homomorphisms and Factor Rings; Prime and Maximal Ideas; Gröbner Bases for Ideals; EXTENSION FIELDS; Introduction to Extension Fields; Vector Spaces; Algebraic Extensions; Geometric Constructions; Finite Fields; ADVANCED GROUP THEORY; Isomorphism Theorems; Series of Groups; Sylow Theorems; Applications of the Sylow Theory; Free Abelian Groups; Free Groups; Group Presentations; GROUPS IN TOPOLOGY; Simplicial Complexes and Homology Groups; Computations of Homology Groups; More Homology Computations and Applications; Homological Algebra; Factorization; Unique Factorization Domains; Euclidean Domains; Gaussian Integers and Multiplicative Norms; AUTOMORPHISMS AND GALOIS THEORY; Automorphisms of Fields; The Isomorphism Extension Theorem; Splitting Fields; Separable Extensions; Totally Inseparable Extensions; Galois Theory; Illustrations of Galois Theory; Cyclotomic Extensions; Insolvability of the Quintic; Matrix Algebra For all readers interested in abstract algebra.", "language": "en", "publishedDate": "2003", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=xb0ZAQAAIAAJ&dq=isbn:0201763907&hl=&cd=1&source=gbs_api", "title": "A first course in abstract algebra", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/A_first_course_in_abstract_algebra.html?hl=&id=xb0ZAQAAIAAJ", "pageCount": 520, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "0201763907", "type": "ISBN_10"}, {"identifier": "9780201763904", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=xb0ZAQAAIAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=xb0ZAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["John B. Fraleigh", "Victor J. Katz"], "ratingsCount": 9, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=xb0ZAQAAIAAJ&dq=isbn:0201763907&hl=&source=gbs_api", "categories": ["Mathematics"], "averageRating": 4.0}, "searchInfo": {"textSnippet": "Focused on groups, rings and fields, this text gives students a firm foundation for more specialized work by emphasizing an understanding of the nature of algebraic structures."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "tRcgm3VHeo0", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=xb0ZAQAAIAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "xb0ZAQAAIAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/xb0ZAQAAIAAJ"}], "kind": "books#volumes"}