{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Allyn & Bacon", "description": "The perfect text for preparing students to work with either treatment (ongoing) or task (special focus) groups, this newly revised edition offers the most up-to-date research and technology available in the social work field. \"An Introduction to Group Work Practice, Fifth Edition,\" continues to stress the importance of developing skills in group-work and provides the most comprehensive information available on the market today. Students receive a thorough grounding in areas that vary from treatment to organizational and community settings. Chapters on the history of groups, group dynamics, group leadership, and diversity help the reader build a solid knowledge base about groups and it apply to real-life social work practice. The addition of new case studies, practice examples, and guiding principles add to the ease and readability of this popular text. New To This Edition Special attention to the problem-solving stages used in social work practice better prepare students for leadership roles in groups. Expanded research-based literature throughout exposes students to more evidence-based practice. More practice problems and short case examples allow students to apply content and obtain feedback, helping to reinforce chapter content. Newly revised material on group dynamics, including information on work with organizations and communities, assessment, group leadership, and diversity students can use in both HBSE, Practice courses and across the baccalaureate curriculum. What Reviewers Are Saying... \"\"The authors' thorough coverage of this material in an organized format is exactly why I chose this text over others.\"\" Janice G. Wells, Ph.D., Winthrop University \"\"The readability of all these chapters... is very good for either graduate or undergraduate level. This is certainly one of the most important overall strong points of the text. \"\" Daniel Liechty, Ph.D., Dmin., ACSW, LCSW, Illinois State University \"\" An Introduction to Group Work Practice is very comprehensive and well-researched. It has the rigor that I would expect in a substantial treatment of this subject, but the accessibility to the beginning student. It's very informative. \"\" Matthew R. Buckley, Ed.D., Delta State University \"\"I believe the text includes virtually everything that should be included in a beginning group work textbook. Its completeness is a great strength. \"\" Kendra J. Garrett, DSW, University of St. Thomas Students, study smarter--not harder--with these grade-boosting supplements from Allyn & Bacon! Instructors, give your students the extraordinary benefits of these study aids by ordering them packaged with this Allyn & Bacon text. Contact your Allyn & Bacon representative for ordering information. Allyn & Bacon's Career Center offers registered students eight 30-minute sessions with a career specialist. This $25.00 retail value is FREE when packaged with any Social Work textbook. For more information visit www.ablongman.com/careercenter.. Title of related interest from Allyn & Bacon: Toseland/Rivas: \"Student Workbook, 5/e\" ISBN: 0-205-42995-5", "language": "en", "publishedDate": "2005", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=RAdHAAAAMAAJ&dq=isbn:0205376061&hl=&cd=1&source=gbs_api", "title": "An Introduction to Group Work Practice", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/An_Introduction_to_Group_Work_Practice.html?hl=&id=RAdHAAAAMAAJ", "pageCount": 544, "maturityRating": "NOT_MATURE", "contentVersion": "0.1.1.0.preview.0", "industryIdentifiers": [{"identifier": "0205376061", "type": "ISBN_10"}, {"identifier": "9780205376063", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=RAdHAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=RAdHAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Ronald W. Toseland", "Robert F. Rivas"], "ratingsCount": 1, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=RAdHAAAAMAAJ&dq=isbn:0205376061&hl=&source=gbs_api", "categories": ["Social Science"], "averageRating": 4.0}, "searchInfo": {"textSnippet": "This is certainly one of the most important overall strong points of the text. &quot;&quot; Daniel Liechty, Ph.D., Dmin., ACSW, LCSW, Illinois State University &quot;&quot; An Introduction to Group Work Practice is very comprehensive and well-researched."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "bQ7Kk6XmW1s", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=RAdHAAAAMAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "RAdHAAAAMAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/RAdHAAAAMAAJ"}], "kind": "books#volumes"}