{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Allyn & Bacon", "description": "\"It's here! MyPsychLab Where learning comes to life!\" An exciting new learning and teaching tool designed to increase student success in the classroom \"and\" give instructors quick and easy access to every resource needed to teach and administer an introductory psychology course. Learning in context With MyPsychLab students use an actual e-book, in the same layout as the printed version, to launch multimedia resources such as animations, video and audio clips, activities and simulations, and more. Individualized Study Plans MyPsychLab gives students multiple testing and quizzing opportunities in each chapter. Results from these assessments generate an Individualized Study Plan that allows students to pinpoint exactly where additional review is needed. Additional help, always available MyPsychLab offers students free access to the Tutor Center - a one on one service during the hours when they need help most. They also get unlimited access to Research Navigator, an online database of academic journals, with help in writing papers and navigating resources. An easy-to-use solution Instructors can spend as much or as little time as they'd like customizing their course. Content is pre-loaded and ready to use. With a click of the mouse, instructors have access to the test item file, class grade book, PowerPoint slides, lecture outlines, and more! Purchased separately, the student resources in MyPsychLab have a total retail value of $135, but students get access at no additional cost with their text purchase! Visit www.mypsychlab.com for more details. For related titles and materials, visit our online catalog at www.ablongman.com. \"Before, I was seldom able to use multimedia in my classroom because our department has a small budget. Due to this exciting new tool, I now have access to every imaginable resource needed to teach and administer a psychology course!\" \"Teresa R. Stalvey, Behavioral Science Instructor, North Florida Community College\" \"The fact that the student names are automatically entered into the grade book is a relief. Being able to check when a student logged in eliminates a few arguments. No more copying syllabi! It's all there for them. I've easily posted class notes, reminders of tests and dates for assignments.\" \"Mary-Ellen O'Sullivan, Psychology Department, Southern Connecticut State University\" \"You have finally organized all the materials that have been stand-alone items for many years.\" \"Fred Whitford, Montana State University\" \"This has been the best decision I've made on a textbook. Thanks again for introducing me to this concept.\" \"Kathy Manuel, Psychology Department, Bossier Parish Community College\"", "language": "en", "publishedDate": "2005", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=baRl64vf030C&dq=isbn:0205457959&hl=&cd=1&source=gbs_api", "title": "Mastering the World of Psychology", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Mastering_the_World_of_Psychology.html?hl=&id=baRl64vf030C", "pageCount": 454, "maturityRating": "NOT_MATURE", "contentVersion": "0.1.0.0.preview.0", "industryIdentifiers": [{"identifier": "0205457959", "type": "ISBN_10"}, {"identifier": "9780205457953", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=baRl64vf030C&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=baRl64vf030C&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Samuel E. Wood", "Ellen Green Wood", "Denise Boyd"], "ratingsCount": 1, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=baRl64vf030C&dq=isbn:0205457959&hl=&source=gbs_api", "categories": ["Psychology"], "averageRating": 4.0}, "searchInfo": {"textSnippet": "&quot; &quot;Teresa R. Stalvey, Behavioral Science Instructor, North Florida Community College&quot; &quot;The fact that the student names are automatically entered into the grade book is a relief."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "01lxhZ0e+0E", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=baRl64vf030C&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "baRl64vf030C", "selfLink": "https://www.googleapis.com/books/v1/volumes/baRl64vf030C"}], "kind": "books#volumes"}