{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "University of Texas Press", "subtitle": "Aztecs, Spaniards, and the Choreography of Conquest", "description": "Winner, Oscar G. Brockett Book Prize in Dance Research, 2014 Honorable Mention, Sally Banes Publication Prize, American Society for Theatre Research, 2014 de la Torre Bueno® Special Citation, Society of Dance History Scholars, 2013 From Christopher Columbus to “first anthropologist” Friar Bernardino de Sahagún, fifteenth- and sixteenth-century explorers, conquistadors, clerics, scientists, and travelers wrote about the “Indian” dances they encountered throughout the New World. This was especially true of Spanish missionaries who intensively studied and documented native dances in an attempt to identify and eradicate the “idolatrous” behaviors of the Aztec, the largest indigenous empire in Mesoamerica at the time of its European discovery. Dancing the New World traces the transformation of the Aztec empire into a Spanish colony through written and visual representations of dance in colonial discourse—the vast constellation of chronicles, histories, letters, and travel books by Europeans in and about the New World. Scolieri analyzes how the chroniclers used the Indian dancing body to represent their own experiences of wonder and terror in the New World, as well as to justify, lament, and/or deny their role in its political, spiritual, and physical conquest. He also reveals that Spaniards and Aztecs shared an understanding that dance played an important role in the formation, maintenance, and representation of imperial power, and describes how Spaniards compelled Indians to perform dances that dramatized their own conquest, thereby transforming them into colonial subjects. Scolieri’s pathfinding analysis of the vast colonial “dance archive” conclusively demonstrates that dance played a crucial role in one of the defining moments in modern history—the European colonization of the Americas.", "language": "en", "publishedDate": "2013-05-01", "readingModes": {"text": false, "image": true}, "previewLink": "http://books.google.com/books?id=VHriMCR5b9AC&printsec=frontcover&dq=isbn:0292744927&hl=&cd=1&source=gbs_api", "title": "Dancing the New World", "printType": "BOOK", "pageCount": 205, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "9780292744929", "type": "ISBN_13"}, {"identifier": "0292744927", "type": "ISBN_10"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=VHriMCR5b9AC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=VHriMCR5b9AC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}, "authors": ["Paul A. Scolieri"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=VHriMCR5b9AC&dq=isbn:0292744927&hl=&source=gbs_api", "categories": ["Performing Arts"], "canonicalVolumeLink": "http://books.google.com/books/about/Dancing_the_New_World.html?hl=&id=VHriMCR5b9AC"}, "searchInfo": {"textSnippet": "Dancing the New World traces the transformation of the Aztec empire into a Spanish colony through written and visual representations of dance in colonial discourse—the vast constellation of chronicles, histories, letters, and travel books ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "lXa7Fb93FU0", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=VHriMCR5b9AC&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": true, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "PARTIAL", "epub": {"isAvailable": false}, "accessViewStatus": "SAMPLE"}, "id": "VHriMCR5b9AC", "selfLink": "https://www.googleapis.com/books/v1/volumes/VHriMCR5b9AC"}], "kind": "books#volumes"}