{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Benjamin Cummings", "description": "ALERT: Before you purchase, check with your instructor or review your course syllabus to ensure that you select the correct ISBN. Several versions of Pearson's MyLab & Mastering products exist for each title, including customized versions for individual schools, and registrations are not transferable. In addition, you may need a CourseID, provided by your instructor, to register for and use Pearson's MyLab & Mastering products. Packages Access codes for Pearson's MyLab & Mastering products may not be included when purchasing or renting from companies other than Pearson; check with the seller before completing your purchase. Used or rental books If you rent or purchase a used book with an access code, the access code may have been redeemed previously and you may have to purchase a new access code. Access codes Access codes that are purchased from sellers other than Pearson carry a higher risk of being either the wrong ISBN or a previously redeemed code. Check with the seller prior to purchase. xxxxxxxxxxxxxxxxxxx The authoritative #1 textbook for introductory majors microbiology, Brock Biology of Microorganisms continues to set the standard for impeccable scholarship, accuracy, and outstanding illustrations and photos. This book for biology, microbiology, and other science majors balances cutting edge research with the concepts essential for understanding the field of microbiology, including strong coverage of ecology, evolution, and metabolism. The Fourteenth Edition seamlessly integrates the most current science, paying particular attention to molecular biology and how the genomic revolution has changed and is changing the field. This edition offers a streamlined, modern organization with a consistent level of detail and updated, visually compelling art program. Brock Biology of Microorganisms includes MasteringMicrobiology® , an online homework, tutorial, and assessment product designed to improve results by helping students quickly master concepts both in and outside the classroom. The Fourteenth Edition and MasteringMicrobiology will provide a better teaching and learning experience--for you and your students. Brock Biology of Microorganisms Plus MasteringMicrobiology is designed to: Personalize learning: MasteringMicrobiology coaches students through the toughest microbiology topics. Engaging tools help students visualize, practice, and understand crucial content. Focus on today's learners: Research-based activities, case studies, and engaging activities improve students' ability to solve problems and make connections between concepts. Teach tough topics with superior art and animations: Outstanding animations, illustrations, and micrographs enable students to understand difficult microbiology concepts and processes. Note: You are purchasing a standalone product; MasteringMicrobiology does not come packaged with this content. If you would like to purchase both the physical text and MasteringMicrobiology search for ISBN-10: 0321897072/ISBN-13: 9780321897077. That package includes ISBN-10: 0321897390/ISBN-13: 9780321897398 and ISBN-10: 0321943732/ISBN-13: 9780321943736. MasteringMicrobiology is not a self-paced technology and should only be purchased when required by an instructor.", "language": "en", "publishedDate": "2014-01-02", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=pAhVnwEACAAJ&dq=isbn:0321897390&hl=&cd=1&source=gbs_api", "title": "Brock Biology of Microorganisms", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Brock_Biology_of_Microorganisms.html?hl=&id=pAhVnwEACAAJ", "pageCount": 1032, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "0321897390", "type": "ISBN_10"}, {"identifier": "9780321897398", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=pAhVnwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=pAhVnwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Michael T. Madigan", "John M. Martinko", "Kelly S. Bender", "Daniel H. Buckley", "David A. Stahl"], "ratingsCount": 2, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=pAhVnwEACAAJ&dq=isbn:0321897390&hl=&source=gbs_api", "categories": ["Science"], "averageRating": 4.0}, "searchInfo": {"textSnippet": "This book for biology, microbiology, and other science majors balances cutting edge research with the concepts essential for understanding the field of microbiology, including strong coverage of ecology, evolution, and metabolism."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "dVyEP24Ux1Q", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=pAhVnwEACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "pAhVnwEACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/pAhVnwEACAAJ"}], "kind": "books#volumes"}