{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Addison-Wesley", "description": "Fundamentals of DATABASE SYSTEMS, Fifth Edition Ramez Elmasri, University of Texas at Arlington Shamkant B. Navathe, Georgia Institute of Technology ISBN 0-321-36957-2 \"Fundamentals of Database Systems is a leading example of a database text that approaches the subject from the technical, rather than the business perspective. It offers instructors more than enough material to choose from as they seek to balance coverage of theoretical with practical material, design with programming, application concerns with implementation issues, and items of historical interest with a view of cutting edge topics.\" Henry A. Etlinger, Rochester Institute of Technology \"This is an outstanding, up-to-date database book, appropriate for both undergraduate and graduate courses. It contains good examples, and clearly describes how to design good, operable databases as well as retrieve and manipulate data from an existing database.\" Peter Ng, The University of Texas - Pan American With clear explanations of theory and design, broad coverage of models and real systems, and an up-to-date introduction to modern database technologies, Elmasri and Navathe's text continues to be the leading introduction to database systems. Current, practical examples keep readers engaged while new end-of-chapter exercises and a new lab manual provide hands-on experience building database applications with modern technologies like Oracle, MySQL, and SQLServer. This Fifth Edition stays fresh with coverage of the latest, most popular database topics, including: Mobile databases, GIS and Genome Databases under emerging applications Database Security A new chapter on Web script programming for databases using PHP", "language": "en", "publishedDate": "2007", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=T19GAQAAIAAJ&dq=isbn:0321369572&hl=&cd=1&source=gbs_api", "title": "Fundamentals of database systems", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Fundamentals_of_database_systems.html?hl=&id=T19GAQAAIAAJ", "pageCount": 1139, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "0321369572", "type": "ISBN_10"}, {"identifier": "9780321369574", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=T19GAQAAIAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=T19GAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Ramez Elmasri", "Sham Navathe"], "ratingsCount": 3, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=T19GAQAAIAAJ&dq=isbn:0321369572&hl=&source=gbs_api", "categories": ["Computers"], "averageRating": 3.5}, "searchInfo": {"textSnippet": "This Fifth Edition stays fresh with coverage of the latest, most popular database topics, including: Mobile databases, GIS and Genome Databases under emerging applications Database Security A new chapter on Web script programming for ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "vmg0anQTBZk", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=T19GAQAAIAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "T19GAQAAIAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/T19GAQAAIAAJ"}], "kind": "books#volumes"}