{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Benjamin Cummings", "description": "Note:¿You are purchasing a standalone product; MasteringMicrobiology does not come packaged with this content. If you would like to purchase¿both¿the physical text and MasteringMicrobiology search for ISBN-10: 032191838X / ISBN-13: 9780321918383. That package includes ISBN-10: 032191855X /ISBN-13: 9780321918550 and ISBN-10: 0321943708 / ISBN-13: 9780321943705. ¿ MasteringMicrobiology is not a self-paced technology and should only be purchased when required by an instructor.¿ ¿ ¿ xxxxxxxxxxxx For pre-nursing and allied health students (including mixed-majors courses). Explore the invisible Robert Bauman’s Microbiology with Diseases by Body System, Fourth Edition retains the hallmark art program and clear writing style that have made his books so successful. The Fourth Edition encourages you to visualize the invisible with new QR codes linking to 18 Video Tutors and 6 Disease in Depth features that motivate you to interact with microbiology content and explore microbiology further. The continued focus on real-world clinical situations prepares you for future opportunities in applied practice and healthcare careers. A more robust MasteringMicrobiology® program works with the text to provide an interactive learning and personalized experience that ensures you learn microbiology both in and out of the classroom. Microbiology with Diseases by Body System Plus MasteringMicrobiology provides an enhanced learning experience. This program provides the ability to: Personalize learning with MasteringMicrobiology: MasteringMicrobiology coaches you through the toughest microbiology topics. Engaging tools help you visualize, practice, and understand crucial content. Think outside the classroom: QR codes in the textbook enable you to use your smartphone or tablet to instantly interact with Dr. Bauman in step-by-step tutorials and explore important developments in microbiology news and research. Focus on critical thinking: Case studies and engaging activities improve your ability to solve problems by keeping you interested. Teach tough topics with superior art: Outstanding art integration through video tutorials, illustrations, and micrographs enables you to absorb and retain difficult microbiology concepts.¿ ¿ ¿ ¿", "language": "en", "publishedDate": "2014-01-10", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=xmcBngEACAAJ&dq=isbn:032191855X&hl=&cd=1&source=gbs_api", "title": "Microbiology with Diseases by Body System", "printType": "BOOK", "pageCount": 936, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "032191855X", "type": "ISBN_10"}, {"identifier": "9780321918550", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=xmcBngEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=xmcBngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Robert W. Bauman"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=xmcBngEACAAJ&dq=isbn:032191855X&hl=&source=gbs_api", "categories": ["Science"], "canonicalVolumeLink": "http://books.google.com/books/about/Microbiology_with_Diseases_by_Body_Syste.html?hl=&id=xmcBngEACAAJ"}, "searchInfo": {"textSnippet": "The Fourth Edition encourages you to visualize the invisible with new QR codes linking to 18 Video Tutors and 6 Disease in Depth features that motivate you to interact with microbiology content and explore microbiology further."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "LAgN4JX/l+I", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=xmcBngEACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "xmcBngEACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/xmcBngEACAAJ"}], "kind": "books#volumes"}