{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Mosby Incorporated", "description": "In an easy-to-follow, highly illustrated approach, this popular text presents the fundamental principles of surgical and medical management of oral surgery problems. This well-organized text defines the role of the general dentist as a member of the surgical management team. Basic techniques of evaluation, diagnosis, and medical management are presented in explicit detail that allows the reader to immediately apply these methods to practice. It provides information on the basic oral surgery procedures that the general practitioner encounters, as well as an overview of oral and maxillofacial surgery procedures performed by the specialist. All surgical techniques are well illustrated so readers can visualize key surgical concepts. Authored by well-known, respected practitioners and contributors in the field of OMS, drawing on their wealth of clinical expertise. Two-color format highlights key concepts and makes information easy to follow. Appendices provide valuable reference sections, including useful examples of prescriptions, postoperative instructions, an informed consent form, and current instrument pricing. A new chapter focuses on facial esthetic surgery, which is often included in a comprehensive treatment plan to complement restorative, prosthetic, and orthodontic treatment. Basic and advanced preprosthetic procedures have been combined into one complete chapter so readers can easily turn to procedures of interest. Enhanced and improved illustrations throughout more accurately depict key concepts and techniques, and many photos have been replaced with new, high-quality images. The chapter on facial neuropathology has been completely revised to present the most up-to-date information on this topic.", "language": "en", "publishedDate": "2003", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=Oi1qAAAAMAAJ&dq=isbn:0323018874&hl=&cd=1&source=gbs_api", "title": "Contemporary Oral and Maxillofacial Surgery", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Contemporary_Oral_and_Maxillofacial_Surg.html?hl=&id=Oi1qAAAAMAAJ", "pageCount": 776, "maturityRating": "NOT_MATURE", "contentVersion": "0.1.1.0.preview.0", "industryIdentifiers": [{"identifier": "0323018874", "type": "ISBN_10"}, {"identifier": "9780323018876", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=Oi1qAAAAMAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Oi1qAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Larry J. Peterson"], "ratingsCount": 1, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=Oi1qAAAAMAAJ&dq=isbn:0323018874&hl=&source=gbs_api", "categories": ["Medical"], "averageRating": 5.0}, "searchInfo": {"textSnippet": "In an easy-to-follow, highly illustrated approach, this popular text presents the fundamental principles of surgical and medical management of oral surgery problems."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "4OU7mRnLEZY", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=Oi1qAAAAMAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "Oi1qAAAAMAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/Oi1qAAAAMAAJ"}], "kind": "books#volumes"}