{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"description": "International business involves at least two sides, foreign multi-national enterprises (MNEs) and local firms. Global strategy used to be the domain of large MNEs built up in developed countries, now there exists numerous smaller, international firms originating in emerging economies. Some of these companies can best be thought of as \"born global\" firms. The recent rise of e-commerce has greatly lowered the entry barriers for these firms to go international. The rising interest in smaller firms reflects current trends in entrepreneurship. Historically, business students have been prepared for a corporate career, especially in the Fortune 500 sector. Large corporations, now often in the business of downsizing and entrepreneurial firms are usually the engine of job creation and economic growth throughout the world. This is an important trend for students to understand and strategize. GLOBAL STRATEGY is the first to focus on how newer companies and companies from emerging economies compete, both inside and outside of their home markets. The author examines local companies' strategies in emerging economies, as MNEs' competitors, collaborators, and/or acquisition targets. This book is unique in its thorough study of Mergers and Acquisitions (M & A) strategies. Global foreign direct investment continues to rise along with cross-border M & As . Increasingly, MNEs are investing a disproportionately higher amount of their resources in emerging economies, in essence, making their strategy more balanced and more global. This balanced understanding of international business is critical to discovering current cutting-edge practices in the field. The text examines the ramifications of a more balanced approach for multi-national enterprises.", "language": "en", "publishedDate": "2006", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=6lRaAAAAYAAJ&dq=isbn:0324288522&hl=&cd=1&source=gbs_api", "title": "Global strategy", "printType": "BOOK", "pageCount": 582, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "CORNELL:31924101878266", "type": "OTHER"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=6lRaAAAAYAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=6lRaAAAAYAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Mike W. Peng"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=6lRaAAAAYAAJ&dq=isbn:0324288522&hl=&source=gbs_api", "categories": ["Business & Economics"], "canonicalVolumeLink": "http://books.google.com/books/about/Global_strategy.html?hl=&id=6lRaAAAAYAAJ"}, "searchInfo": {"textSnippet": "This is an important trend for students to understand and strategize. GLOBAL STRATEGY is the first to focus on how newer companies and companies from emerging economies compete, both inside and outside of their home markets."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "/35ZOyAYPxU", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=6lRaAAAAYAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "6lRaAAAAYAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/6lRaAAAAYAAJ"}], "kind": "books#volumes"}