{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Springer Science & Business Media", "description": "One may have various reasons for compiling a volume of papers devoted to and inspired by Walras and Pareto. Pareto succeeded Walras in 1893 on the chair of Political Economy at the University of Lausanne. The relation between the two was not always without tensions, although Pareto, on the occasion of his 25 years jubilee celebration, at least in part, transferred the honours offered to him to Walras. Indeed, one may say that to a substantial extent important parts of the works of Pareto would not have been possible without the insights of Walras. Both eminent scientists also have in common that the image of their inheritance professed to the common university trained economic scholars ('cutes') is a highly restricted caricature of the fullnes of their essential insights and contributions, and students of sociology or politicology may even finish their academic studies without ever having heard the name of Pareto. What cutes \"know\" about Walras amounts to the following caricature. Walras developed the general economic equilibrium model, but did not care about uniqueness and stability of an equilibrium. It is a model with exchange and production only and it assumes an auctioneer who announces price vectors to establish the equilibrium. The model presupposes perfect information and is static and certainly not dynamic. Walras had a bias towards free competition and laisser faire and neglected monopoly and taxation. Pareto is known by the cutes as the founding father of welfare economics. At best one is informed the notions of Pareto-optimality conditions and the first and second welfare theorems. But welfare economics is in general disappearing from the university research and teaching programs, replaced as it is by consumer and producer surpluses in the nowadays flourishing partial industrial economics programs. In this thought-provoking collection, ten international scholars offer reflections and new interpretations of Walras’and Pareto’s unique contributions to topics as broad as the over-arching important of the social sciences, the development of modern microeconomics and (in particular) econometrics, political economy and public choice, and political sociology. Their insights will be of particular interest to researchers and scholars of economic history, political sociology, and the social sciences.", "language": "en", "publishedDate": "2006-09-12", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=-027AAAAIAAJ&dq=isbn:0387337563&hl=&cd=1&source=gbs_api", "title": "From Walras to Pareto", "printType": "BOOK", "pageCount": 138, "maturityRating": "NOT_MATURE", "contentVersion": "0.5.0.0.preview.0", "industryIdentifiers": [{"identifier": "STANFORD:36105123545480", "type": "OTHER"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=-027AAAAIAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=-027AAAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["J.A. Hans Maks"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=-027AAAAIAAJ&dq=isbn:0387337563&hl=&source=gbs_api", "categories": ["Business & Economics"], "canonicalVolumeLink": "http://books.google.com/books/about/From_Walras_to_Pareto.html?hl=&id=-027AAAAIAAJ"}, "searchInfo": {"textSnippet": "In this thought-provoking collection, ten international scholars offer reflections and new interpretations of Walras’and Pareto’s unique contributions to topics as broad as the over-arching important of the social sciences, the ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "gu1weILqVaQ", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=-027AAAAIAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "-027AAAAIAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/-027AAAAIAAJ"}], "kind": "books#volumes"}