{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Wiley", "subtitle": "Tools for Business Decision Making", "description": "Now in its Fourth Edition, Kimmel, Weygandt, and Kieso's Financial Accounting: Tools for Business Decision Making has been tested and approved in the classroom. Whether you measure classroom success by improved grades, students who are better prepared for the Intermediate course and their future careers, or by student evaluations at the end of the semester, Financial Accounting delivers real results. \"If you are teaching a debit/credit centered financial accounting principles class there is not a better written or organized text. Believe me I have looked. The supporting materials for instructors [are] also terrific.\" --Nancy Snow, University of Toledo \"The textbook is well written with good examples and homework problems. This book is easy to understand, but is rigorous in its coverage of accounting issues.\" --Paul Brazina, La Salle University, Philadelphia \"Best presentation of material in the industry. In addition, Financial, Managerial and Intermediate all flow together for greater coverage and comprehension.\" --Vince Enslein, Clinton Community College Key Features * WileyPLUS gives instructors the technology they need to create an environment where students can reach their full potential and experience academic success. www.wiley.com/college/wileyplus * New Accounting Across the Organization features place accounting issues within the context of students' majors. * Updated with expanded content on Sarbanes-Oxley and Corporate Governance. * New Comprehensive Problems combine concepts across chapters. * A new Continuing Cookie Chronicle problem traces the growth of an entrepreneurial venture and enables students to apply their newly acquired accounting skills. * Identifies the tools students will need to make real business decisions. * Provides balanced coverage of the accounting cycle at a level that is appropriate to what students need in the business world. * Emphasizes the accounting experiences of real high-profile companies, such as Tootsie Roll, Microsoft, Nike, and Intel.", "language": "en", "publishedDate": "2006-01-18", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=VsRfQgAACAAJ&dq=isbn:0471730513&hl=&cd=1&source=gbs_api", "title": "Financial Accounting", "printType": "BOOK", "pageCount": 832, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "0471730513", "type": "ISBN_10"}, {"identifier": "9780471730514", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=VsRfQgAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=VsRfQgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Paul D. Kimmel", "Jerry J. Weygandt", "Donald E. Kieso"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=VsRfQgAACAAJ&dq=isbn:0471730513&hl=&source=gbs_api", "categories": ["Business & Economics"], "canonicalVolumeLink": "http://books.google.com/books/about/Financial_Accounting.html?hl=&id=VsRfQgAACAAJ"}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "IZ7EiIWHXpI", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=VsRfQgAACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "VsRfQgAACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/VsRfQgAACAAJ"}], "kind": "books#volumes"}