{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "John Wiley & Sons", "description": "A cut above the rest! Kring, Davison, Neale, and Johnson’s Abnormal Psychology sets the standard for clarity, cutting-edge coverage, authoritative content, and clinical emphasis. The authors invite students to examine the many different facets of psychopathology­­­––to search for clues, follow-up on hunches, and evaluate evidence on the origins of these disorders and the effectiveness of specific interventions. Now in their new 10th Edition, the authors have also greatly expanded the text’s pedagogical features, making it even more student-friendly, engaging, and informative. “Current trends in the field are well reflected with the sections on genetics, neuroscience, and cognitive science.” – Jack Nitschke,University of Wisconsin “I was particularly impressed by the skill with which the authors were able to discuss complex material in a clear fashion.” – Janice Kiecolt-Glaser, Ohio State University WileyPLUS helps students reach their full potential WileyPLUS provides everything needed to create an environment where students can reach their full potential and experience the exhilaration of academic success. With WileyPLUS, students can: Access a complete online version of the text with hyperlinks that extend content. Come to class better prepared for lectures. Receive immediate feedback and context-sensitive help on assignments and quizzes. With WileyPLUS, professors can: Assign automatically graded homework and quizzes. Track students progress through the course. Administer their course, even with existing course management systems (including WebCT and Blackboard). Visit www.wiley.com/college/wileyplus or contact your Wiley representative for more information. Also available Case Studies in Abnormal Psychology, 7th Edition Thomas F. Oltmanns, Michele Martin, John M. Neale, Gerald C. Davison ISBN: 0-471-73112-9", "language": "en", "publishedDate": "2007-01", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=v0EeAQAAIAAJ&dq=isbn:0471692387&hl=&cd=1&source=gbs_api", "title": "Abnormal Psychology", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Abnormal_Psychology.html?hl=&id=v0EeAQAAIAAJ", "pageCount": 720, "maturityRating": "NOT_MATURE", "contentVersion": "1.1.1.0.preview.0", "industryIdentifiers": [{"identifier": "STANFORD:36105126856785", "type": "OTHER"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=v0EeAQAAIAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=v0EeAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Ann M. Kring", "Gerald C. Davison"], "ratingsCount": 1, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=v0EeAQAAIAAJ&dq=isbn:0471692387&hl=&source=gbs_api", "categories": ["Psychology"], "averageRating": 3.0}, "searchInfo": {"textSnippet": "With WileyPLUS, students can: Access a complete online version of the text with hyperlinks that extend content. Come to class better prepared for lectures. Receive immediate feedback and context-sensitive help on assignments and quizzes."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "SuZt7PK6+u8", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=v0EeAQAAIAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "v0EeAQAAIAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/v0EeAQAAIAAJ"}], "kind": "books#volumes"}