{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Wiley", "description": "Specific guidelines for making financial decisions in an international context Learn how to make sound financial decisions in the multinational firm with Alan Shapiro's Eighth Edition of Multinational Financial Management. Shapiro provides a clear conceptual framework for analyzing key financial decisions in multinational firms-a framework that you can rely on throughout your career. Keep up with current financial events around the globe. The new Eighth Edition is thoroughly updated with enhanced discussions of the impact of China on the international financial system, current issues facing the euro, the debate over outsourcing, the political considerations underlying the debate over protectionism, the competitive devaluations during 2003, and more. Make smart decisions. Multinational Financial Management focuses on decision making in an international context. The text presents analytical techniques that translate the often vague rules of thumb used by international financial executives into specific decision criteria. Learn how to take advantage of being multinational. Too often companies focus on the threats and risks inherent in venturing abroad. In contrast, Alan Shapiro emphasizes the opportunities that are available to multinational firms, such as the ability to obtain a greater degree of international diversification and the ability to arbitrage between imperfect capital markets. Examine real international financial problems. Throughout the text, a variety of real-life cases and examples, including new mini-cases in most chapters, demonstrate how to use financial analysis and reasoning to solve real international financial problems.", "language": "en", "publishedDate": "2006-01-09", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=HCG5AAAAIAAJ&dq=isbn:0471737690&hl=&cd=1&source=gbs_api", "title": "Multinational Financial Management", "printType": "BOOK", "pageCount": 768, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "UCSD:31822035219591", "type": "OTHER"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=HCG5AAAAIAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=HCG5AAAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Alan C. Shapiro"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=HCG5AAAAIAAJ&dq=isbn:0471737690&hl=&source=gbs_api", "categories": ["Business & Economics"], "canonicalVolumeLink": "http://books.google.com/books/about/Multinational_Financial_Management.html?hl=&id=HCG5AAAAIAAJ"}, "searchInfo": {"textSnippet": "Throughout the text, a variety of real-life cases and examples, including new mini-cases in most chapters, demonstrate how to use financial analysis and reasoning to solve real international financial problems."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "L6PO2zyp/UM", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=HCG5AAAAIAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "HCG5AAAAIAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/HCG5AAAAIAAJ"}], "kind": "books#volumes"}