{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Cengage Learning", "description": "For the 11th edition of BIOLOGY: UNITY AND DIVERSITY OF LIFE, Cecie Starr and Ralph Taggart made it their goal to solve some of the toughest Introductory Biology course challenges. We introduce a new issues-oriented approach with engages students in current, motivating biological topics; a built-in cross-referencing system for key topics; and, most importantly, time-saving media resources for instructors. Show students how biology matters - Opening each chapter with engaging essays on hot issues and related online voting, the text highlights the connections between biology and real-life. Online exercises promote critical thinking about issues students will face as consumers, parents and citizens. Link concepts from chapter to chapter - Students often have a difficult time with this, so the authors created a linking tool. A list at the start of each chapter reminds students of related topics that were explained earlier. Within chapters, a key icon identifies cross-references to relevant sections in earlier chapters. As students work through the text, they see how topics build upon one another. Monitoring students’ progress with ease - BiologyNowTM offers diagnostic quizzes with automatically graded results that flow directly into your instructor gradebook (iLrn, WebCT or BlackBoard). And, to assess students’ progress instantly with in-class quizzes and polls, you can use JoinInTM on TurningPoint content and software. Easier lecture prep - The new PowerLecture tool integrates all chapter assets - art, photos, animations, videos, links to InfoTrac articles, web links and everything else you need into each chapter’s lecture slides. This buffet of media resources-arranged by chapter section is at your fingertips. Just cut and paste what you want into your lecture file. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.", "language": "en", "publishedDate": "2005-11-23", "readingModes": {"text": false, "image": true}, "previewLink": "http://books.google.com/books?id=b3ueiPcTaXEC&printsec=frontcover&dq=isbn:0495015997&hl=&cd=1&source=gbs_api", "title": "Biology: The Unity and Diversity of Life", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Biology_The_Unity_and_Diversity_of_Life.html?hl=&id=b3ueiPcTaXEC", "pageCount": 1056, "maturityRating": "NOT_MATURE", "contentVersion": "0.2.0.0.preview.1", "industryIdentifiers": [{"identifier": "9780495015994", "type": "ISBN_13"}, {"identifier": "0495015997", "type": "ISBN_10"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=b3ueiPcTaXEC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=b3ueiPcTaXEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}, "authors": ["Cecie Starr", "Ralph Taggart"], "ratingsCount": 1, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=b3ueiPcTaXEC&dq=isbn:0495015997&hl=&source=gbs_api", "categories": ["Science"], "averageRating": 3.0}, "searchInfo": {"textSnippet": "For the 11th edition of BIOLOGY: UNITY AND DIVERSITY OF LIFE, Cecie Starr and Ralph Taggart made it their goal to solve some of the toughest Introductory Biology course challenges."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "lJUykgN4jFM", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=b3ueiPcTaXEC&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": true, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "PARTIAL", "epub": {"isAvailable": false}, "accessViewStatus": "SAMPLE"}, "id": "b3ueiPcTaXEC", "selfLink": "https://www.googleapis.com/books/v1/volumes/b3ueiPcTaXEC"}], "kind": "books#volumes"}