{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Cengage Learning", "description": "METEOROLOGY TODAY has for many years been one of the most widely used and authoritative texts for the introductory meteorology course. This eighth edition sees improvements in flexibility for instructors and strengthened learning solutions for students. Author C. Donald Ahrens has been widely praised for his ability to explain relatively complicated ideas so that even under-prepared students can understand them. The text's clear and inviting narrative is supplemented by numerous pedagogical features that help augment students' understanding. Introductory stories found at the beginning of each chapter draw students naturally into the discussion. In-chapter reviews help students master concepts while they study, and four types of end-of-chapter exercises provide opportunities for everything from further review to in-class discussion questions. In addition to these in-text learning aids, the eighth edition sees a complete integration with CengageNOW, the first assessment-driven and student-centered online learning solution created specifically for this course. CengageNOW uses a series of chapter-specific diagnostic tests to build a personalized learning plan for each student, allowing students to focus their study time on specific areas of weaknesses. Each personalized learning plan directs students to specific chapter sections and concept-driven multimedia tutorials designed to augment their understanding. The new edition is available in its original nineteen chapter classic version, or as a core version, which features only the most popular sixteen chapters. The core version sacrifices none of the detail that the course needs, but eliminates chapters that may not be directly covered in class. Looking for more flexibility? With the Cengage Learning TextChoice custom solution program, instructors can select and reorganize chapters to perfectly match their syllabus, thereby creating the ideal text solution for the course. Important Notice: Media content referenced within the product description or the product text may not be available in the ebook version.", "language": "en", "publishedDate": "2006-02-16", "readingModes": {"text": false, "image": true}, "previewLink": "http://books.google.com/books?id=SpGfKb23Y9QC&printsec=frontcover&dq=isbn:0495011622&hl=&cd=1&source=gbs_api", "title": "Meteorology Today", "printType": "BOOK", "pageCount": 624, "maturityRating": "NOT_MATURE", "contentVersion": "0.2.0.0.preview.1", "industryIdentifiers": [{"identifier": "9780495011620", "type": "ISBN_13"}, {"identifier": "0495011622", "type": "ISBN_10"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=SpGfKb23Y9QC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=SpGfKb23Y9QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}, "authors": ["C. Donald Ahrens"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=SpGfKb23Y9QC&dq=isbn:0495011622&hl=&source=gbs_api", "categories": ["Science"], "canonicalVolumeLink": "http://books.google.com/books/about/Meteorology_Today.html?hl=&id=SpGfKb23Y9QC"}, "searchInfo": {"textSnippet": "This eighth edition sees improvements in flexibility for instructors and strengthened learning solutions for students."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "8Lb4rbBXLiQ", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=SpGfKb23Y9QC&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": true, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "PARTIAL", "epub": {"isAvailable": false}, "accessViewStatus": "SAMPLE"}, "id": "SpGfKb23Y9QC", "selfLink": "https://www.googleapis.com/books/v1/volumes/SpGfKb23Y9QC"}], "kind": "books#volumes"}