{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Brooks/Cole Publishing Company", "description": "John McMurry's international best-seller is widely and consistently praised as the most clearly written book on the market. Why? In John McMurry's words: \"I have been asked hundreds of times over the past ten years why I wrote this book. I wrote this book because I love writing. I get great pleasure and satisfaction from taking a complicated subject, turning it around until I see it clearly from a new angle, and then explaining it in simple words. I write to explain chemistry to students the way I wish it had been explained to me years ago.\" Through his lucid writing and ability to show the beauty and logic of organic chemistry, McMurry makes learning enjoyable for students. The highest compliment that can be given to a chemistry book applies to McMurry: It works! Mainstream in level, McMurry's coverage is concise yet doesn't omit any key topics. McMurry blends the traditional functional-group approach with a mechanistic approach. The primary approach, by functional group, begins with the simple and progresses to the more complex so that readers who are not yet versed in the subtleties of mechanisms are first exposed to the \"what\" of chemistry before beginning to grapple with the \"why.\" Within this primary organization, the author places a heavy emphasis on explaining the fundamental mechanistic similarities.In this edition, McMurry retains his standard-setting features (including his innovative vertical format for explaining reaction mechanisms) while revising his text line-by-line to include hundreds of small but important improvements. For example, the Sixth Edition includes new examples, additional steps in existing examples, new problems, new phrases to clarify the exposition, and a vibrant new art program. In addition, new icons in the text lead students to a variety of new online resources. McMurry's text is in use at hundreds of colleges and universities around the world, from North America, to the United Kingdom and the Pacific Rim.", "language": "en", "publishedDate": "2004", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=izBHAQAAIAAJ&dq=isbn:0534389996&hl=&cd=1&source=gbs_api", "title": "Organic Chemistry", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Organic_Chemistry.html?hl=&id=izBHAQAAIAAJ", "pageCount": 1176, "maturityRating": "NOT_MATURE", "contentVersion": "0.1.1.0.preview.0", "industryIdentifiers": [{"identifier": "UCSD:31822035742360", "type": "OTHER"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=izBHAQAAIAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=izBHAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["John McMurry"], "ratingsCount": 9, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=izBHAQAAIAAJ&dq=isbn:0534389996&hl=&source=gbs_api", "categories": ["Science"], "averageRating": 3.5}, "searchInfo": {"textSnippet": "Why? In John McMurry&#39;s words: &quot;I have been asked hundreds of times over the past ten years why I wrote this book. I wrote this book because I love writing."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "Qbv6SiOkiEY", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=izBHAQAAIAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "izBHAQAAIAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/izBHAQAAIAAJ"}], "kind": "books#volumes"}