{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "W B Saunders Company", "subtitle": "A Write-in Text Explaining Medical Terms", "description": "This market-leading text helps readers understand and learn complex medical terms by dividing them into their component parts, clearly explaining the meanings of these terms in the context of how the body works in health and disease. Terminology and complex medical processes are described an easy-to-understand manner that is readily accessible to readers of all levels. The Language of Medicine brings medical terms to life with a workbook format organized by body systems, offering additional chapters on specific key areas of health care, such as cancer and psychiatry. Anatomy and physiology sections are generously illustrated in full color and reinforced with exercises on combining forms in terminology and word parts. Instructor resources are available; please contact your Elsevier sales representative for details. Trusted Language of Medicine instructional method has been used by nearly 2 million students to learn, understand, remember and apply medical terminology. All chapters have been extensively reviewed by medical experts, including some of the leading practitioners in the field, ensuring that content is up to date, accurate, and relevant to current medical practice. Clear illustrations of anatomy, physiology, and pathology provide a real-world context and point of reference for learning medical terms and how they apply to practice. Simple, clear, non-technical explanations of terms makes the knowledge accessible even to readers with little or no previous medical or science background. Organization by body system with additional chapters on specialty medical areas helps readers understand medical words based on how they apply within the body system, function, or application. Explanations of clinical procedures, laboratory tests, and abbreviations related to each body system or medical specialty show medical terminology in practice. Pronunciation of Terms list at the end of each chapter provides phonetic spellings and spaces to write the meanings of terms. An audio glossary of over 3,000 terms on CD-ROM strengthens learning through auditory reinforcement while encouraging correct pronunciation. Case Scenarios and Practical Applications in each chapter with case reports, operative and diagnostic tests, laboratory and x-ray reports allow readers to apply knowledge to real work situations. A wealth of exercises including Section Exercises, exercises within each chapter, Comprehensive Exercises, review sections, and Pronunciation Exercises challenge readers to test their understanding of material. Practical Application Exercises at the end of each chapter and throughout text chapters provide \"real life\" scenarios that show medical language in action. New, more interactive Student CD features a full audio glossary of all medical vocabulary words in the text, as well as new animation and video clips. New conditions and updated, accurate information allows readers to relate to current information such as SARS, the latest information on ear infections, HIV encephalopathy, and hormone replacement research. The most recent advances are reflected throughout, especially in fast-changing medical fields where accuracy and active application to current medicine is essential. New dynamic photographs showing some of the most common skin conditions. Expanded and enhanced section of laboratory tests featuring a bolded summary before the full explanation. A more intuitive organization, relocating the radiological oncology material from the radiology chapter to the oncology chapter (Chapter 19).", "language": "en", "publishedDate": "2004-01-01", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=F0RNPgAACAAJ&dq=isbn:0721697577&hl=&cd=1&source=gbs_api", "title": "The Language of Medicine", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/The_Language_of_Medicine.html?hl=&id=F0RNPgAACAAJ", "pageCount": 999, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "0721697577", "type": "ISBN_10"}, {"identifier": "9780721697574", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=F0RNPgAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=F0RNPgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Davi-Ellen Chabner"], "ratingsCount": 5, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=F0RNPgAACAAJ&dq=isbn:0721697577&hl=&source=gbs_api", "categories": ["Medical"], "averageRating": 4.5}, "searchInfo": {"textSnippet": "This market-leading text helps readers understand and learn complex medical terms by dividing them into their component parts, clearly explaining the meanings of these terms in the context of how the body works in health and disease."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "rA7T1LSd5wE", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=F0RNPgAACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "F0RNPgAACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/F0RNPgAACAAJ"}], "kind": "books#volumes"}