{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Benjamin-Cummings Publishing Company", "description": "KEY BENEFIT:Elements of Ecology, Sixth Edition maintains its engaging, reader-friendly style as it explains the basic principles of ecology. The text is updated to include new chapters on current ecological topics; new part introductions to connect the subfields of ecology; and new in-text features to encourage students to interpret the ecological data, research, and models used throughout the text. Abundant, accessible examples illustrate and clarify the text's emphasis on understanding ecological patterns within an evolutionary framework. Additionally, the text employs new study questions requiring students to make connections and apply their knowledge. KEY TOPICS: Introduction and Background, The Nature of Ecology, Adaptation and Evolution, The Physical Environment, Climate, The Aquatic Environment, The Terrestrial Environment, Organismal Ecology, Plant Adaptations, Animal Adaptations, Life History Patterns, Population Ecology,Properties of Populations, Population Growth, Interspecific Population Regulation, Metapopulations, The Ecology of Species Interactions,Competition, Predation, Parasitism and Mutualism, Community Ecology,Community Structure, Factors Influencing the Structure of Communities, Community Dynamics, Landscape Ecology, Ecosystem Ecology, Ecosystem Energetics, Decomposition and Nutrient Cycling, Biogeochemical Cycles, Biogeographical Ecology,Terrestrial Ecosystems, Aquatic Ecosystems, Land-Water Interface, Large-scale Patterns of Biodiversity, Human Ecology, Population Growth, Resource Use, and Sustainability, Habitat Decline, Biodiversity, and Conservation Ecology, Global Climate Change. MARKET: For all readers interested in the basic principles ecology.", "language": "en", "publishedDate": "2006", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=8DBFAQAAIAAJ&dq=isbn:0805348301&hl=&cd=1&source=gbs_api", "title": "Elements of Ecology", "printType": "BOOK", "pageCount": 658, "maturityRating": "NOT_MATURE", "contentVersion": "0.1.1.0.preview.0", "industryIdentifiers": [{"identifier": "STANFORD:36105114534816", "type": "OTHER"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=8DBFAQAAIAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=8DBFAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Thomas Michael Smith", "Robert Leo Smith"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=8DBFAQAAIAAJ&dq=isbn:0805348301&hl=&source=gbs_api", "categories": ["Nature"], "canonicalVolumeLink": "http://books.google.com/books/about/Elements_of_Ecology.html?hl=&id=8DBFAQAAIAAJ"}, "searchInfo": {"textSnippet": "The text is updated to include new chapters on current ecological topics; new part introductions to connect the subfields of ecology; and new in-text features to encourage students to interpret the ecological data, research, and models used ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "VSc/LMImMiQ", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=8DBFAQAAIAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "8DBFAQAAIAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/8DBFAQAAIAAJ"}], "kind": "books#volumes"}