{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "MAA", "description": "Beginning with one of the most remarkable ecological collapses of recent time, that of the passenger pigeon, Hadlock goes on to survey collapse processes across the entire spectrum of the natural and man-made world. He takes us through extreme weather events, technological disasters, evolutionary processes, crashing markets and companies, the chaotic nature of Earth's orbit, revolutionary political change, the spread and elimination of disease, and many other fascinating cases. His key thesis is that one or more of six fundamental dynamics consistently show up across this wide range. These \"six sources of collapse\" can all be best described and investigated using fundamental mathematical concepts. They include low probability events, group dynamics, evolutionary games, instability, nonlinearity, and network effects, all of which are explained in readily understandable terms. Almost the entirety of the book can be understood by readers with a minimal mathematical background, but even professional mathematicians are likely to get rich insights from the range of examples. The author tells his story with a warmly personal tone and weaves in many of his own experiences, whether from his consulting career of racing around the world trying to head off industrial disasters to his story of watching collapse after collapse in the evolution of an ecosystem on his New Hampshire farm. Creative teachers could use this book for anything from a liberal arts math course to a senior capstone seminar, and one reviewer suggested that” it should be required reading for any mathematics graduate student heading off into a teaching career.” This book will also be of interest to readers in the fields under discussion, such as business, engineering, ecology, political science, and others.", "language": "en", "publishedDate": "2012", "readingModes": {"text": false, "image": true}, "previewLink": "http://books.google.com/books?id=2Pkn45p5hQMC&printsec=frontcover&dq=isbn:0883855798&hl=&cd=1&source=gbs_api", "title": "Six Sources of Collapse", "printType": "BOOK", "pageCount": 207, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "9780883855799", "type": "ISBN_13"}, {"identifier": "0883855798", "type": "ISBN_10"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=2Pkn45p5hQMC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=2Pkn45p5hQMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}, "authors": ["Charles R. Hadlock"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=2Pkn45p5hQMC&dq=isbn:0883855798&hl=&source=gbs_api", "categories": ["Mathematics"], "canonicalVolumeLink": "http://books.google.com/books/about/Six_Sources_of_Collapse.html?hl=&id=2Pkn45p5hQMC"}, "searchInfo": {"textSnippet": "Creative teachers could use this book for anything from a liberal arts math course to a senior capstone seminar, and one reviewer suggested that” it should be required reading for any mathematics graduate student heading off into a ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "JZUCRIx/WW8", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=2Pkn45p5hQMC&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": true, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "PARTIAL", "epub": {"isAvailable": false}, "accessViewStatus": "SAMPLE"}, "id": "2Pkn45p5hQMC", "selfLink": "https://www.googleapis.com/books/v1/volumes/2Pkn45p5hQMC"}], "kind": "books#volumes"}