{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "John Wiley & Sons", "description": "Growing a small business requires more than just sales Business Development For Dummies helps maximise the growth of small- or medium-sized businesses, with a step-by-step model for business development designed specifically for B2B or B2C service firms. By mapping business development to customer life cycle, this book helps owners and managers ensure a focus on growth through effective customer nurturing and management. It's not just sales! In-depth coverage also includes strategy, marketing, client management, and partnerships/alliances, helping you develop robust business practices that can be used every day. You'll learn how to structure, organise, and execute an effective development plan, with step-by-step expert guidance. Realising that you can't just \"hire a sales guy\" and expect immediate results is one of the toughest lessons small business CEOs have to learn. Developing a business is about more than just gaining customers – it's about integrating every facet of your business in an overarching strategy that continually works toward growth. Business Development For Dummies provides a model, and teaches you what you need to know to make it work for your business. Learn the core concepts of business development, and how it differs from sales Build a practical, step-by-step business development strategy Incorporate marketing, sales, and customer management in general planning Develop and implement a growth-enhancing partnership strategy Recognising that business development is much more than just sales is the first important step to sustained growth. Development should be daily – not just when business starts to tail off, or you fall into a cycle of growth and regression. Plan for growth, and make it stick – Business Development For Dummies shows you how.", "language": "en", "publishedDate": "2015-02-23", "readingModes": {"text": false, "image": true}, "previewLink": "http://books.google.com/books?id=kVMqBgAAQBAJ&printsec=frontcover&dq=isbn:1118962710&hl=&cd=1&source=gbs_api", "title": "Business Development For Dummies", "printType": "BOOK", "pageCount": 384, "maturityRating": "NOT_MATURE", "contentVersion": "0.2.0.0.preview.1", "industryIdentifiers": [{"identifier": "9781118962718", "type": "ISBN_13"}, {"identifier": "1118962710", "type": "ISBN_10"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=kVMqBgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=kVMqBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}, "authors": ["Anna Kennedy"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=kVMqBgAAQBAJ&dq=isbn:1118962710&hl=&source=gbs_api", "categories": ["Business & Economics"], "canonicalVolumeLink": "http://books.google.com/books/about/Business_Development_For_Dummies.html?hl=&id=kVMqBgAAQBAJ"}, "searchInfo": {"textSnippet": "By mapping business development to customer life cycle, this book helps owners and managers ensure a focus on growth through effective customer nurturing and management. It&#39;s not just sales!"}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "1eu5jO6w470", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=kVMqBgAAQBAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": true, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "PARTIAL", "epub": {"isAvailable": false}, "accessViewStatus": "SAMPLE"}, "id": "kVMqBgAAQBAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/kVMqBgAAQBAJ"}], "kind": "books#volumes"}