{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "John Wiley & Sons", "description": "Power system operation from an operator’s perspective Power systems are operated with the primary objectives of safety, reliability, and efficiency. Practical Power System Operation is the first book to provide a comprehensive picture of power system operation for both professional engineers and students alike. The book systematically describes the operator’s functions, the processes required to operate the system, and the enabling technology solutions deployed to facilitate the processes. In his book, Dr. Ebrahim Vaahedi, an expert practitioner in the field, presents a holistic review of: The current state and workings of power system operation Problems encountered by operators and solutions to remedy the problems Individual operator functions, processes, and the enabling technology solutions Deployment of real-time assessment, control, and optimization solutions in power system operation Energy Management Systems and their architecture Distribution Management Systems and their architecture Power system operation in the changing energy industry landscape and the evolving technology solutions Because power system operation is such a critical function around the world, the consequences of improper operation range from financial repercussions to societal welfare impacts that put people’s safety at risk. Practical Power System Operation includes a step-by-step illustrated guide to the operator functions, processes, and decision support tools that enable the processes. As a bonus, it includes a detailed review of the emerging technology and operation solutions that have evolved over the last few years. Written to the standards of higher education and university curriculums, Practical Power System Operation has been classroom tested for excellence and is a must-read for anyone looking to learn the critical skills they need for a successful career in power system operations.", "language": "en", "publishedDate": "2014-04-07", "readingModes": {"text": true, "image": false}, "previewLink": "http://books.google.com/books?id=3P3WAgAAQBAJ&dq=isbn:111839402X&hl=&cd=1&source=gbs_api", "title": "Practical Power System Operation", "printType": "BOOK", "pageCount": 248, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "111839402X", "type": "ISBN_10"}, {"identifier": "9781118394021", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=3P3WAgAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=3P3WAgAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Ebrahim Vaahedi"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=3P3WAgAAQBAJ&dq=isbn:111839402X&hl=&source=gbs_api", "categories": ["Technology & Engineering"], "canonicalVolumeLink": "http://books.google.com/books/about/Practical_Power_System_Operation.html?hl=&id=3P3WAgAAQBAJ"}, "searchInfo": {"textSnippet": "Practical Power System Operation is the first book to provide a comprehensive picture of power system operation for both professional engineers and students alike."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "QrDoP959iTI", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=3P3WAgAAQBAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "3P3WAgAAQBAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/3P3WAgAAQBAJ"}], "kind": "books#volumes"}