{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "John Wiley & Sons", "subtitle": "Designing for Security", "description": "The only security book to be chosen as a Dr. Dobbs Jolt Award Finalist since Bruce Schneier's Secrets and Lies and Applied Cryptography! Adam Shostack is responsible for security development lifecycle threat modeling at Microsoft and is one of a handful of threat modeling experts in the world. Now, he is sharing his considerable expertise into this unique book. With pages of specific actionable advice, he details how to build better security into the design of systems, software, or services from the outset. You'll explore various threat modeling approaches, find out how to test your designs against threats, and learn effective ways to address threats that have been validated at Microsoft and other top companies. Systems security managers, you'll find tools and a framework for structured thinking about what can go wrong. Software developers, you'll appreciate the jargon-free and accessible introduction to this essential skill. Security professionals, you'll learn to discern changing threats and discover the easiest ways to adopt a structured approach to threat modeling. Provides a unique how-to for security and software developers who need to design secure products and systems and test their designs Explains how to threat model and explores various threat modeling approaches, such as asset-centric, attacker-centric and software-centric Provides effective approaches and techniques that have been proven at Microsoft and elsewhere Offers actionable how-to advice not tied to any specific software, operating system, or programming language Authored by a Microsoft professional who is one of the most prominent threat modeling experts in the world As more software is delivered on the Internet or operates on Internet-connected devices, the design of secure software is absolutely critical. Make sure you're ready with Threat Modeling: Designing for Security.", "language": "en", "publishedDate": "2014-02-17", "readingModes": {"text": false, "image": true}, "previewLink": "http://books.google.com/books?id=asPDAgAAQBAJ&printsec=frontcover&dq=isbn:1118809998&hl=&cd=1&source=gbs_api", "title": "Threat Modeling", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Threat_Modeling.html?hl=&id=asPDAgAAQBAJ", "pageCount": 624, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "9781118809990", "type": "ISBN_13"}, {"identifier": "1118809998", "type": "ISBN_10"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=asPDAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=asPDAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}, "authors": ["Adam Shostack"], "ratingsCount": 3, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=asPDAgAAQBAJ&dq=isbn:1118809998&hl=&source=gbs_api", "categories": ["Computers"], "averageRating": 3.0}, "searchInfo": {"textSnippet": "-- Use threat modeling to enhance software security If you&#39;re a software developer, systems manager, or security professional, this book will show you how to use threat modeling in the security development lifecycle and in the overall ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "1Uwpm/WF30E", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=asPDAgAAQBAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": true, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "PARTIAL", "epub": {"isAvailable": false}, "accessViewStatus": "SAMPLE"}, "id": "asPDAgAAQBAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/asPDAgAAQBAJ"}], "kind": "books#volumes"}