{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "CRC Press", "description": "Before software engineering builds and installations can be implemented into software and/or systems integrations in military and aerospace programs, a comprehensive understanding of the software development life cycle is required. Covering all the development life cycle disciplines, Effective Methods for Software and Systems Integration explains how to select and apply a life cycle that promotes effective and efficient software and systems integration. The book defines time-tested methods for systems engineering, software design, software engineering informal/formal builds, software engineering installations, software and systems integration, delivery activities, and product evaluations. Explaining how to deal with scheduling issues, the text considers the use of IBM Rational ClearCase and ClearQuest tools for software and systems integration. It also: Presents methods for planning, coordination, software loading, and testing Addresses scheduling issues and explains how to plan to coordinate with customers Covers all development life cycle disciplines Explains how to select and apply a life cycle that promotes effective and efficient software and systems integration The text includes helpful forms—such as an audit checklist, a software/systems integration plan, and a software checklist PCA. Providing you with the understanding to achieve continuous improvements in quality throughout the software life cycle, it will help you deliver projects that are on time and within budget constraints in developmental military and aerospace programs as well as the software industry.", "language": "en", "publishedDate": "2012-06-01", "readingModes": {"text": false, "image": true}, "previewLink": "http://books.google.com/books?id=jbeR9nQQi10C&printsec=frontcover&dq=isbn:1439876622&hl=&cd=1&source=gbs_api", "title": "Effective Methods for Software and Systems Integration", "printType": "BOOK", "pageCount": 183, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "9781439876626", "type": "ISBN_13"}, {"identifier": "1439876622", "type": "ISBN_10"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=jbeR9nQQi10C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=jbeR9nQQi10C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}, "authors": ["Boyd L. Summers"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=jbeR9nQQi10C&dq=isbn:1439876622&hl=&source=gbs_api", "categories": ["Business & Economics"], "canonicalVolumeLink": "http://books.google.com/books/about/Effective_Methods_for_Software_and_Syste.html?hl=&id=jbeR9nQQi10C"}, "searchInfo": {"textSnippet": "The book defines time-tested methods for systems engineering, software design, software engineering informal/formal builds, software engineering installations, software and systems integration, delivery activities, and product evaluations."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "CRW+n9o86rk", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=jbeR9nQQi10C&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": true, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "PARTIAL", "epub": {"isAvailable": false}, "accessViewStatus": "SAMPLE"}, "id": "jbeR9nQQi10C", "selfLink": "https://www.googleapis.com/books/v1/volumes/jbeR9nQQi10C"}], "kind": "books#volumes"}