{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Springer", "description": "Stochastic reachability analysis (SRA) is a method of analyzing the behavior of control systems which mix discrete and continuous dynamics. For probabilistic discrete systems it has been shown to be a practical verification method but for stochastic hybrid systems it can be rather more. As a verification technique SRA can assess the safety and performance of, for example, autonomous systems, robot and aircraft path planning and multi-agent coordination but it can also be used for the adaptive control of such systems. Stochastic Reachability Analysis of Hybrid Systems is a self-contained and accessible introduction to this novel topic in the analysis and development of stochastic hybrid systems. Beginning with the relevant aspects of Markov models and introducing stochastic hybrid systems, the book then moves on to coverage of reachability analysis for stochastic hybrid systems. Following this build up, the core of the text first formally defines the concept of reachability in the stochastic framework and then treats issues representing the different faces of SRA: • stochastic reachability based on Markov process theory; • martingale methods; • stochastic reachability as an optimal stopping problem; and • dynamic programming. The book is rounded off by an appendix providing mathematical underpinning on subjects such as ordinary differential equations, probabilistic measure theory and stochastic modeling, which will help the non-expert-mathematician to appreciate the text. Stochastic Reachability Analysis of Hybrid Systems characterizes a highly interdisciplinary area of research and is consequently of significant interest to academic researchers and graduate students from a variety of backgrounds in control engineering, applied mathematics and computer science. The Communications and Control Engineering series reports major technological advances which have potential for great impact in the fields of communication and control. It reflects research in industrial and academic institutions around the world so that the readership can exploit new possibilities as they become available.", "language": "en", "publishedDate": "2012-02-19", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=_amhpwAACAAJ&dq=isbn:1447127943&hl=&cd=1&source=gbs_api", "title": "Stochastic Reachability Analysis of Hybrid Systems", "printType": "BOOK", "pageCount": 250, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "1447127943", "type": "ISBN_10"}, {"identifier": "9781447127949", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=_amhpwAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=_amhpwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Luminita Manuela Bujorianu"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=_amhpwAACAAJ&dq=isbn:1447127943&hl=&source=gbs_api", "categories": ["Science"], "canonicalVolumeLink": "http://books.google.com/books/about/Stochastic_Reachability_Analysis_of_Hybr.html?hl=&id=_amhpwAACAAJ"}, "searchInfo": {"textSnippet": "Stochastic Reachability Analysis of Hybrid Systems is a self-contained and accessible introduction to this novel topic in the analysis and development of stochastic hybrid systems."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "liImlfBGnRg", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=_amhpwAACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "_amhpwAACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/_amhpwAACAAJ"}], "kind": "books#volumes"}