{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Penguin Press", "subtitle": "The Idealist, 1923-1968", "description": "The definitive biography of Henry Kissinger, based on unprecedented access to his private papers, by an acclaimed historian at the height of his powers No American statesman has been as revered and as reviled as Henry Kissinger. Once hailed as “Super-K”—the “indispensable man” whose advice has been sought by every president from Kennedy to Obama—he has also been hounded by conspiracy theorists, scouring his every “telcon” for evidence of Machiavellian malfeasance. Yet as Niall Ferguson shows in this magisterial biography, the idea of Kissinger as the ruthless arch-realist is based on a profound misunderstanding. Drawing not only on Kissinger’s hitherto closed private papers but also on documents from more than a hundred archives around the world, Ferguson argues that the true foundation of Kissinger’s thought is philosophical idealism—combined with history itself. The first half of Kissinger’s life is usually skimmed over as a quintessential tale of American ascent: the Jewish refugee from Hitler’s Germany who made it to the White House. But in this first of two volumes, Ferguson shows that what Kissinger achieved before his appointment as Richard Nixon’s national security adviser was astonishing in its own right. Toiling as a teenager in a New York factory, he studied indefatigably at night. He was drafted into the U.S. infantry and saw action at the Battle of the Bulge—as well as the liberation of a concentration camp—but ended his army career interrogating Nazis. It was at Harvard that Kissinger found his vocation. Having immersed himself in the philosophy of Kant and the diplomacy of Metternich, he shot to celebrity by arguing for “limited nuclear war.” Nelson Rockefeller hired him. Kennedy called him to Camelot. Yet Kissinger’s rise was anything but irresistible. Dogged by press gaffes and disappointed by “Rocky,” Kissinger seemed stuck—until a trip to Vietnam changed everything. The Idealist is the story of the single most important strategic thinker America has ever produced. It is also a political Bildungsroman, explaining how “Dr. Strangelove” ended up as consigliere to a politician he had always abhorred. Like Ferguson’s classic two-volume history of the House of Rothschild, Kissinger sheds dazzling new light on an entire era. The essential account of an extraordinary life, it recasts the cold war world.", "language": "en", "publishedDate": "2015-09-29", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=_EgcrgEACAAJ&dq=isbn:1594206538&hl=&cd=1&source=gbs_api", "title": "Kissinger: Volume I", "printType": "BOOK", "pageCount": 656, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "1594206538", "type": "ISBN_10"}, {"identifier": "9781594206535", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=_EgcrgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=_EgcrgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Niall Ferguson"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=_EgcrgEACAAJ&dq=isbn:1594206538&hl=&source=gbs_api", "categories": ["Biography & Autobiography"], "canonicalVolumeLink": "http://books.google.com/books/about/Kissinger_Volume_I.html?hl=&id=_EgcrgEACAAJ"}, "searchInfo": {"textSnippet": "Yet as Niall Ferguson shows in this magisterial two-volume biography, drawing not only on Kissinger s hitherto closed private papers but also on documents from more than a hundred archives around the world, the idea of Kissinger as the ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "7P6w6xKF29Y", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=_EgcrgEACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "_EgcrgEACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/_EgcrgEACAAJ"}], "kind": "books#volumes"}