{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Manning Publications", "description": "Summary Gradle in Action is a comprehensive guide to end-to-end project automation with Gradle. Starting with the basics, this practical, easy-to-read book discusses how to build a full-fledged, real-world project. Along the way, it touches on advanced topics like testing, continuous integration, and monitoring code quality. You'll also explore tasks like setting up your target environment and deploying your software. About the Technology Gradle is a general-purpose build automation tool. It extends the usage patterns established by its forerunners, Ant and Maven, and allows builds that are expressive, maintainable, and easy to understand. Using a flexible Groovy-based DSL, Gradle provides declarative and extendable language elements that let you model your project's needs the way you want. About the Book Gradle in Action is a comprehensive guide to end-to-end project automation with Gradle. Starting with the basics, this practical, easy-to-read book discusses how to establish an effective build process for a full-fledged, real-world project. Along the way, it covers advanced topics like testing, continuous integration, and monitoring code quality. You'll also explore tasks like setting up your target environment and deploying your software. The book assumes a basic background in Java, but no knowledge of Groovy. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. Whats Inside A comprehensive guide to Gradle Practical, real-world examples Transitioning from Ant and Maven In-depth plugin development Continuous delivery with Gradle About the Author Benjamin Muschko is a member of the Gradleware engineering team and the author of several popular Gradle plugins. Table of Contents PART 1 INTRODUCING GRADLE Introduction to project automation Next-generation builds with Gradle Building a Gradle project by example PART 2 MASTERING THE FUNDAMENTALS Build script essentials Dependency management Multiproject builds Testing with Gradle Extending Gradle Integration and migration PART 3 FROM BUILD TO DEPLOYMENT IDE support and tooling Building polyglot projects Code quality management and monitoring Continuous integration Artifact assembly and publishing Infrastructure provisioning and deployment", "language": "en", "publishedDate": "2013-06-30", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=H9nmmgEACAAJ&dq=isbn:1617291307&hl=&cd=1&source=gbs_api", "title": "Gradle in Action", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Gradle_in_Action.html?hl=&id=H9nmmgEACAAJ", "pageCount": 456, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "1617291307", "type": "ISBN_10"}, {"identifier": "9781617291302", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=H9nmmgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=H9nmmgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Benjamin Muschko"], "ratingsCount": 5, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=H9nmmgEACAAJ&dq=isbn:1617291307&hl=&source=gbs_api", "categories": ["Computers"], "averageRating": 3.0}, "searchInfo": {"textSnippet": "The book assumes a basic background in Java, but no knowledge of Groovy. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "4Fj0avbGtGc", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=H9nmmgEACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "H9nmmgEACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/H9nmmgEACAAJ"}], "kind": "books#volumes"}