{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Manning Publications", "description": "Summary HTML5 in Action provides a complete introduction to web development using HTML5. You'll explore every aspect of the HTML5 specification through real-world examples and code samples. It's much more than just a specification reference, though. It lives up to the name HTML5 in Action by giving you the practical, hands-on guidance you'll need to use key features. About the Technology HTML5 is not a few new tags and features added to an old standard—it's the foundation of the modern web, enabling its interactive services, single-page UI, interactive games, and complex business applications. With support for standards-driven mobile app development, powerful features like local storage and WebSockets, superb audio and video APIs, and new layout options using CSS3, SVG, and Canvas, HTML5 has entered its prime time. About the Book HTML5 in Action provides a complete introduction to web development using HTML5. It explores the HTML5 specification through real-world examples and code samples. It earns the name \"in Action\" by giving you the practical, hands-on guidance you'll need to confidently build the sites and applications you—and your clients—have been wanting for years. This book concentrates on new HTML5 features and assumes you are familiar with standard HTML. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. What's Inside New semantic elements and form input types Single-page application design Creating interactive graphics Mobile web apps About the Authors Rob Crowther is a web developer and blogger and the author of Manning's Hello! HTML5 & CSS3. Joe Lennon is an enterprise mobile application developer. Ash Blue builds award-winning interactive projects. Greg Wanish is an independent web and eCommerce developer. Table of Contents PART 1 INTRODUCTION HTML5: from documents to applications PART 2 BROWSER-BASED APPS Form creation: input widgets, data binding, and data validation File editing and management: rich formatting, file storage, drag and drop Messaging: communicating to and from scripts in HTML5 Mobile applications: client storage and offline execution PART 3 INTERACTIVE GRAPHICS, MEDIA, AND GAMING 2D Canvas: low-level, 2D graphics rendering SVG: responsive in-browser graphics Video and audio: playing media in the browser WebGL: 3D application development Plus 10 Appendixes", "language": "en", "publishedDate": "2013-07-28", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=Xwt7tgAACAAJ&dq=isbn:1617290491&hl=&cd=1&source=gbs_api", "title": "HTML5 in Action", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/HTML5_in_Action.html?hl=&id=Xwt7tgAACAAJ", "pageCount": 444, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "1617290491", "type": "ISBN_10"}, {"identifier": "9781617290497", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=Xwt7tgAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=Xwt7tgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Rob Crowther", "Joe Lennon", "Ash Blue", "Greg Wanish"], "ratingsCount": 1, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=Xwt7tgAACAAJ&dq=isbn:1617290491&hl=&source=gbs_api", "categories": ["Computers"], "averageRating": 4.0}, "searchInfo": {"textSnippet": "This book concentrates on new HTML5 features and assumes you are familiar with standard HTML. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "mnqDRMdn1kw", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=Xwt7tgAACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "Xwt7tgAACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/Xwt7tgAACAAJ"}], "kind": "books#volumes"}