{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Packt", "subtitle": "", "description": "Learn the syntax interactively to smoothly transition to Scala by reusing your Java code Leverage the full power of modern web programming by building scalable and reactive applications Easy to follow instructions and real world examples to help you integrate java code and tackle big data challenges In Detail Scala for Java Developers is a step-by-step guide full of easy-to-follow code taken from real-world examples explaining the migration and integration of Scala in a Java project. With this book, you will first get comfortable with the Scala syntax and its Java-like ecosystem, and then dive into new ways of building reactive web apps using the Typesafe stack including the actor-based Akka framework, the Play web framework, and the emerging Slick framework for persistence. The book will then teach you how to review useful tools for unit, integration, and functional testing; demonstrate how integrating with external systems applies to the Scala world and what its benefits are. From learning the Scala syntax interactively to writing modern, scalable, reactive applications, this book will help you to take your skills to the next level by solving complex problems in a concise and maintainable way. What you will learn from this book - Apply and control the Scala Ecosystem - Migrate Java code to Scala - Discover Play Framework web development - Test data using Scala's testing frameworks - Manipulate XML and JSON in Scala - Learn the Scala syntax interactively - Integrate Java projects in Scala - Build reactive web apps using the Typesafe stack - Use new systems including the Akka framework, the Play web framework, and the emerging Slick framework - Tackle big data challenges", "language": "en", "publishedDate": "2014-05-01", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=fNarCQAAQBAJ&dq=isbn:1783283637&hl=&cd=1&source=gbs_api", "title": "Scala for Java Developers", "printType": "BOOK", "canonicalVolumeLink": "http://books.google.com/books/about/Scala_for_Java_Developers.html?hl=&id=fNarCQAAQBAJ", "pageCount": 282, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "9781783283637", "type": "ISBN_13"}, {"identifier": "1783283637", "type": "ISBN_10"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=fNarCQAAQBAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=fNarCQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Thomas Alexandre"], "ratingsCount": 2, "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=fNarCQAAQBAJ&dq=isbn:1783283637&hl=&source=gbs_api", "categories": ["Computers"], "averageRating": 4.5}, "searchInfo": {"textSnippet": "With this book, you will first get comfortable with the Scala syntax and its Java-like ecosystem, and then dive into new ways of building reactive web apps using the Typesafe stack including the actor-based Akka framework, the Play web ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "EaOROG1lXAs", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=fNarCQAAQBAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": true}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "fNarCQAAQBAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/fNarCQAAQBAJ"}], "kind": "books#volumes"}