{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Springer", "description": "The latest scientific knowledge on climate change indicates that higher greenhouse gas concentrations in the atmosphere through unchecked emissions will provoke severe climate change and ocean acidification. Both impacts can fundamentally alter environmental structures on which humanity relies and have serious consequences for the food chain among others. Climate change therefore poses major socio-economic, technical and environmental challenges which will have serious impacts on countries’ pathways towards sustainable development. As a result, climate change and sustainable development have increasingly become interlinked. A changing climate makes achieving Millennium Development Goals more difficult and expensive, so there is every reason to achieve development goals with low greenhouse gas emissions. This leads to the following five challenges discussed by Challenges and Solutions for Climate Change: 1. To place climate negotiations in the wider context of sustainability, equity and social change so that development benefits can be maximised at the same time as decreasing greenhouse gas emissions. 2. To select technologies or measures for climate change mitigation and adaptation based on countries’ sustainable development and climate goals. 3. To create low greenhouse gas emission and climate resilient strategies and action plans in order to accelerate innovation needed for achieving sustainable development and climate goals on the scale and timescale required within countries. 4. To rationalize the current directions in international climate policy making in order to provide coherent and efficient support to developing countries in devising and implementing strategies and action plans for low emission technology transfers to deliver climate and sustainable development goals. 5. To facilitate development of an international framework for financial resources in order to support technology development and transfer, improve enabling environments for innovation, address equity issues such as poor people’s energy access, and make implementation of activities possible at the desired scale within the country. The solutions presented in Challenges and Solutions for Climate Change show how ambitious measures can be undertaken which are fully in line with domestic interests, both in developing and in developed countries, and how these measures can be supported through the international mechanisms.", "language": "en", "publishedDate": "2012-05-23", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=TNk-LgEACAAJ&dq=isbn:1849963983&hl=&cd=1&source=gbs_api", "title": "Challenges and Solutions for Climate Change", "printType": "BOOK", "pageCount": 162, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "1849963983", "type": "ISBN_10"}, {"identifier": "9781849963985", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=TNk-LgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=TNk-LgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Wytze van der Gaast", "Katherine Begg"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=TNk-LgEACAAJ&dq=isbn:1849963983&hl=&source=gbs_api", "categories": ["Business & Economics"], "canonicalVolumeLink": "http://books.google.com/books/about/Challenges_and_Solutions_for_Climate_Cha.html?hl=&id=TNk-LgEACAAJ"}, "searchInfo": {"textSnippet": "The solutions presented in Challenges and Solutions for Climate Change show how ambitious measures can be undertaken which are fully in line with domestic interests, both in developing and in developed countries, and how these measures can ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "dQV+pcb6s48", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=TNk-LgEACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "TNk-LgEACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/TNk-LgEACAAJ"}], "kind": "books#volumes"}