{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Springer", "subtitle": "A Hybrid Approach Based on Fuzzy Logic, Neural Networks and Genetic Algorithms", "description": "Intelligent Control considers non-traditional modelling and control approaches to nonlinear systems. Fuzzy logic, neural networks and evolutionary computing techniques are the main tools used. The book presents a modular switching fuzzy logic controller where a PD-type fuzzy controller is executed first followed by a PI-type fuzzy controller thus improving the performance of the controller compared with a PID-type fuzzy controller. The advantage of the switching-type fuzzy controller is that it uses one rule-base thus minimises the rule-base during execution. A single rule-base is developed by merging the membership functions for change of error of the PD-type controller and sum of error of the PI-type controller. Membership functions are then optimized using evolutionary algorithms. Since the two fuzzy controllers were executed in series, necessary further tuning of the differential and integral scaling factors of the controller is then performed. Neural-network-based tuning for the scaling parameters of the fuzzy controller is then described and finally an evolutionary algorithm is applied to the neurally-tuned-fuzzy controller in which the sigmoidal function shape of the neural network is determined. The important issue of stability is addressed and the text demonstrates empirically that the developed controller was stable within the operating range. The text concludes with ideas for future research to show the reader the potential for further study in this area. Intelligent Control will be of interest to researchers from engineering and computer science backgrounds working in the intelligent and adaptive control.", "language": "en", "publishedDate": "2013-12-16", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=lrd5ngEACAAJ&dq=isbn:3319021346&hl=&cd=1&source=gbs_api", "title": "Intelligent Control", "printType": "BOOK", "pageCount": 282, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "3319021346", "type": "ISBN_10"}, {"identifier": "9783319021348", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=lrd5ngEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=lrd5ngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Nazmul Siddique"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=lrd5ngEACAAJ&dq=isbn:3319021346&hl=&source=gbs_api", "categories": ["Technology & Engineering"], "canonicalVolumeLink": "http://books.google.com/books/about/Intelligent_Control.html?hl=&id=lrd5ngEACAAJ"}, "searchInfo": {"textSnippet": "The book presents a modular switching fuzzy logic controller where a PD-type fuzzy controller is executed first followed by a PI-type fuzzy controller thus improving the performance of the controller compared with a PID-type fuzzy ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "EVHIJ4BvUIQ", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=lrd5ngEACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "lrd5ngEACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/lrd5ngEACAAJ"}], "kind": "books#volumes"}