{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Springer", "subtitle": "The SPES 2020 Methodology", "description": "Embedded systems have long become essential in application areas in which human control is impossible or infeasible. The development of modern embedded systems is becoming increasingly difficult and challenging because of their overall system complexity, their tighter and cross-functional integration, the increasing requirements concerning safety and real-time behavior, and the need to reduce development and operation costs. This book provides a comprehensive overview of the Software Platform Embedded Systems (SPES) modeling framework and demonstrates its applicability in embedded system development in various industry domains such as automation, automotive, avionics, energy, and healthcare. In SPES 2020, twenty-one partners from academia and industry have joined forces in order to develop and evaluate in different industrial domains a modeling framework that reflects the current state of the art in embedded systems engineering. The content of this book is structured in four parts. Part I “Starting Point” discusses the status quo of embedded systems development and model-based engineering, and summarizes the key requirements faced when developing embedded systems in different application domains. Part II “The SPES Modeling Framework” describes the SPES modeling framework. Part III “Application and Evaluation of the SPES Modeling Framework” reports on the validation steps taken to ensure that the framework met the requirements discussed in Part I. Finally, Part IV “Impact of the SPES Modeling Framework” summarizes the results achieved and provides an outlook on future work. The book is mainly aimed at professionals and practitioners who deal with the development of embedded systems on a daily basis. Researchers in academia and industry may use it as a compendium for the requirements and state-of-the-art solution concepts for embedded systems development.", "language": "en", "publishedDate": "2012-11-09", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=eeS8MgEACAAJ&dq=isbn:3642346138&hl=&cd=1&source=gbs_api", "title": "Model-Based Engineering of Embedded Systems", "printType": "BOOK", "pageCount": 304, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "3642346138", "type": "ISBN_10"}, {"identifier": "9783642346132", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=eeS8MgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=eeS8MgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Klaus Pohl", "Harald Hönninger", "Reinhold Achatz", "Manfred Broy"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=eeS8MgEACAAJ&dq=isbn:3642346138&hl=&source=gbs_api", "categories": ["Computers"], "canonicalVolumeLink": "http://books.google.com/books/about/Model_Based_Engineering_of_Embedded_Syst.html?hl=&id=eeS8MgEACAAJ"}, "searchInfo": {"textSnippet": "This book provides a comprehensive overview of the Software Platform Embedded Systems (SPES) modeling framework and demonstrates its applicability in embedded system development in various industry domains such as automation, automotive, ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "k5E4qgOCmr8", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=eeS8MgEACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "eeS8MgEACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/eeS8MgEACAAJ"}], "kind": "books#volumes"}