{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Springer", "subtitle": "Research and Practice", "description": "The issue of data quality is as old as data itself. However, the proliferation of diverse, large-scale and often publically available data on the Web has increased the risk of poor data quality and misleading data interpretations. On the other hand, data is now exposed at a much more strategic level e.g. through business intelligence systems, increasing manifold the stakes involved for individuals, corporations as well as government agencies. There, the lack of knowledge about data accuracy, currency or completeness can have erroneous and even catastrophic results. With these changes, traditional approaches to data management in general, and data quality control specifically, are challenged. There is an evident need to incorporate data quality considerations into the whole data cycle, encompassing managerial/governance as well as technical aspects. Data quality experts from research and industry agree that a unified framework for data quality management should bring together organizational, architectural and computational approaches. Accordingly, Sadiq structured this handbook in four parts: Part I is on organizational solutions, i.e. the development of data quality objectives for the organization, and the development of strategies to establish roles, processes, policies, and standards required to manage and ensure data quality. Part II, on architectural solutions, covers the technology landscape required to deploy developed data quality management processes, standards and policies. Part III, on computational solutions, presents effective and efficient tools and techniques related to record linkage, lineage and provenance, data uncertainty, and advanced integrity constraints. Finally, Part IV is devoted to case studies of successful data quality initiatives that highlight the various aspects of data quality in action. The individual chapters present both an overview of the respective topic in terms of historical research and/or practice and state of the art, as well as specific techniques, methodologies and frameworks developed by the individual contributors. Researchers and students of computer science, information systems, or business management as well as data professionals and practitioners will benefit most from this handbook by not only focusing on the various sections relevant to their research area or particular practical work, but by also studying chapters that they may initially consider not to be directly relevant to them, as there they will learn about new perspectives and approaches.", "language": "en", "publishedDate": "2013-05-23", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=i6UqlwEACAAJ&dq=isbn:3642362567&hl=&cd=1&source=gbs_api", "title": "Handbook of Data Quality", "printType": "BOOK", "pageCount": 438, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "3642362567", "type": "ISBN_10"}, {"identifier": "9783642362569", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=i6UqlwEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=i6UqlwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Shazia Sadiq"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=i6UqlwEACAAJ&dq=isbn:3642362567&hl=&source=gbs_api", "categories": ["Computers"], "canonicalVolumeLink": "http://books.google.com/books/about/Handbook_of_Data_Quality.html?hl=&id=i6UqlwEACAAJ"}, "searchInfo": {"textSnippet": "Accordingly, Sadiq structured this handbook in four parts: Part I is on organizational solutions, i.e. the development of data quality objectives for the organization, and the development of strategies to establish roles, processes, ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "Zi8/ImlOBxM", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=i6UqlwEACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "i6UqlwEACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/i6UqlwEACAAJ"}], "kind": "books#volumes"}