{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Springer", "description": "Ocean Dynamics’ is a concise introduction to the fundamentals of fluid mechanics, non-equilibrium thermodynamics and the common approximations for geophysical fluid dynamics, presenting a comprehensive approach to large-scale ocean circulation theory. The book is written on the physical and mathematical level of graduate students in theoretical courses of physical oceanography, meteorology and environmental physics. An extensive bibliography and index, extensive side notes and recommendations for further reading, and a comparison with the specific atmospheric physics where applicable, makes this volume also a useful reading for researchers. Each of the four parts of the book – fundamental laws, common approximations, ocean waves, oceanic turbulence and eddies, and selected aspects of ocean dynamics – starts with elementary considerations, blending then classical topics with more advanced developments of fluid mechanics and theoretical oceanography. The last part covers the theory of the global wind-driven circulation in homogeneous and stratified regimes, the circulation and overturning in the Southern Ocean, and the global meridional overturning and thermohaline-driven circulation. Emphasis is placed on simple physical models rather than access to extensive numerical results, enabling students to understand and reproduce the complex theory mostly by analytical means. All equations and models are derived in detail and illustrated by numerous figures. The appendix provides short excursions into the mathematical background, such as vector analysis, statistics, and differential equations", "language": "en", "publishedDate": "2012-06-05", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=IY4-XwAACAAJ&dq=isbn:3642234496&hl=&cd=1&source=gbs_api", "title": "Ocean Dynamics", "printType": "BOOK", "pageCount": 704, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "3642234496", "type": "ISBN_10"}, {"identifier": "9783642234491", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=IY4-XwAACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=IY4-XwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Dirk Olbers", "Jürgen Willebrand", "Carsten Eden"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=IY4-XwAACAAJ&dq=isbn:3642234496&hl=&source=gbs_api", "categories": ["Science"], "canonicalVolumeLink": "http://books.google.com/books/about/Ocean_Dynamics.html?hl=&id=IY4-XwAACAAJ"}, "searchInfo": {"textSnippet": "An extensive bibliography and index, extensive side notes and recommendations for further reading, and a comparison with the specific atmospheric physics where applicable, makes this volume also a useful reading for researchers."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "atAsR8SFxNQ", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=IY4-XwAACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "IY4-XwAACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/IY4-XwAACAAJ"}], "kind": "books#volumes"}