{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Springer", "description": "This book is a pedagogical introduction to supergravity, a gravitational field theory that includes supersymmetry (symmetry between bosons and fermions) and is a generalization of Einstein's general relativity. Supergravity provides a low-energy effective theory of superstring theory, which has attracted much attention as a candidate for the unified theory of fundamental particles, and it is a useful tool for studying non-perturbative properties of superstring theory such as D-branes and string duality. This work considers classical supergravities in four and higher spacetime dimensions with their applications to superstring theory in mind. More concretely, it discusses classical Lagrangians (or field equations) and symmetry properties of supergravities. Besides local symmetries, supergravities often have global non-compact symmetries, which play a crucial role in their applications to superstring theory. One of the main features of this book is its detailed discussion of these non-compact symmetries. The aim of the book is twofold. One is to explain the basic ideas of supergravity to those who are not familiar with it. Toward that end, the discussions are made both pedagogical and concrete by stating equations explicitly. The other is to collect relevant formulae in one place so as to be useful for applications to string theory. The subjects discussed in this book include the vielbein formulation of gravity, supergravities in four dimensions, possible types of spinors in various dimensions, superalgebras and supermultiplets, non-linear sigma models for non-compact Lie groups, electric-magnetic duality symmetries, supergravities in higher dimensions, dimensional reductions, and gauged and massive supergravities.", "language": "en", "publishedDate": "2014-08-01", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=IM3QoAEACAAJ&dq=isbn:4431548270&hl=&cd=1&source=gbs_api", "title": "Introduction to Supergravity", "printType": "BOOK", "pageCount": 130, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "4431548270", "type": "ISBN_10"}, {"identifier": "9784431548270", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=IM3QoAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=IM3QoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Yoshiaki Tanii"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=IM3QoAEACAAJ&dq=isbn:4431548270&hl=&source=gbs_api", "categories": ["Science"], "canonicalVolumeLink": "http://books.google.com/books/about/Introduction_to_Supergravity.html?hl=&id=IM3QoAEACAAJ"}, "searchInfo": {"textSnippet": "One of the main features of this book is its detailed discussion of these non-compact symmetries. The aim of the book is twofold. One is to explain the basic ideas of supergravity to those who are not familiar with it."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "MbleCUmVp8E", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=IM3QoAEACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "IM3QoAEACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/IM3QoAEACAAJ"}], "kind": "books#volumes"}