{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Springer", "description": "What is this sound? What does that sound indicate? These are two questions frequently heard in daily conversation. Sound results from the vibrations of elastic media and in daily life provides informative signals of events happening in the surrounding environment. In interpreting auditory sensations, the human ear seems particularly good at extracting the signal signatures from sound waves. Although exploring auditory processing schemes may be beyond our capabilities, source signature analysis is a very attractive area in which signal-processing schemes can be developed using mathematical expressions. This book is inspired by such processing schemes and is oriented to signature analysis of waveforms. Most of the examples in the book are taken from data of sound and vibrations; however, the methods and theories are mostly formulated using mathematical expressions rather than by acoustical interpretation. This book might therefore be attractive and informative for scientists, engineers, researchers, and graduate students who are interested in the mathematical representation of signals and the applications of Fourier analysis. The book can be described as being practically self-contained but does assume readers are familiar with introductory topics in discrete signal processing, as in the discrete Fourier transform. Hence this book might be also usable as a textbook in graduate courses in applied mathematics on topics such as complex functions. Almost all scientific phenomena are sensed as waves propagating in some space. Over the years, waveform analysis has therefore been one of the resilient academic areas of study and still is seen as fertile ground for development. In particular, waveform analysis based on the theory of linear systems would be a good example where a physical interpretation can be given to the mathematical theory of complex functions in terms of magnitude, angle, poles, and zeros of complex functions. For readers who are interested in the physical aspects of sound and vibration data or elementary formulation of wave equations and their solutions, the book Sound and Signals by M. Tohyama (Springer 2011) is recommended. It can serve as a complementary companion to this present volume or independently as a good reference.", "language": "en", "publishedDate": "2015-01-20", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=6hzHmgEACAAJ&dq=isbn:4431544232&hl=&cd=1&source=gbs_api", "title": "Waveform Analysis of Sound", "printType": "BOOK", "pageCount": 229, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "4431544232", "type": "ISBN_10"}, {"identifier": "9784431544234", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=6hzHmgEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=6hzHmgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Mikio Tohyama"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=6hzHmgEACAAJ&dq=isbn:4431544232&hl=&source=gbs_api", "categories": ["Technology & Engineering"], "canonicalVolumeLink": "http://books.google.com/books/about/Waveform_Analysis_of_Sound.html?hl=&id=6hzHmgEACAAJ"}, "searchInfo": {"textSnippet": "It can serve as a complementary companion to this present volume or independently as a good reference. What is this sound? What does that sound indicate? These are two questions frequently heard in daily conversation."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "CU7gms1aixA", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=6hzHmgEACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "6hzHmgEACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/6hzHmgEACAAJ"}], "kind": "books#volumes"}