{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Springer", "description": "The book entitled “Prospects in Bioscience: Addressing the issues” is a collection of selected research papers presented at the International Conference on Advances in Biological Sciences (ICABS) organized by the Department of Biotechnology and Microbiology and the Inter University Centre for Bioscience, Kannur University, Kerala, India. ICABS witnessed a unique spectrum of Scientific Programmes on the most recent and exciting developments in modern biology. The conference displayed the numerous breakthroughs and significant developments in the important areas of modern biology and their relevance to the welfare of global society. The Book contains 50 well written chapters, each one discussing scientifically organized findings of original research work done in reputed laboratories. Needless to say, they deal with advances in various disciplines of modern biology including Cell and Molecular Biology, Structural Biology, Industrial and Environmental Biotechnology, Food and Agricultural Biotechnology and Medical Biotechnology. As the title rightly indicates, the chapters project the prospects in the respective areas and the issues in them. Specific issues discussed in the book includes development of transgenic plants, bioremediation of toxic industrial effluents, biotransformation for novel antibiotics, biofertilizer development, molecular drug designing and structure elucidation, molecular identification of pathogens, production of anti microbials, biocontrol agents and bioactive molecules, cancer biology, plant breeding and hybrid seed production etc. The book with its contents spreading across the vast arena of modern biology is expected to cater to the need of researchers, technologists and students.", "language": "en", "publishedDate": "2013-01-11", "readingModes": {"text": false, "image": false}, "previewLink": "http://books.google.com/books?id=s5h2MAEACAAJ&dq=isbn:8132208099&hl=&cd=1&source=gbs_api", "title": "Prospects in Bioscience: Addressing the Issues", "printType": "BOOK", "pageCount": 430, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "8132208099", "type": "ISBN_10"}, {"identifier": "9788132208099", "type": "ISBN_13"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=s5h2MAEACAAJ&printsec=frontcover&img=1&zoom=5&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=s5h2MAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api"}, "authors": ["Abdulhameed Sabu", "Anu Augustine"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=s5h2MAEACAAJ&dq=isbn:8132208099&hl=&source=gbs_api", "categories": ["Science"], "canonicalVolumeLink": "http://books.google.com/books/about/Prospects_in_Bioscience_Addressing_the_I.html?hl=&id=s5h2MAEACAAJ"}, "searchInfo": {"textSnippet": "The book entitled “Prospects in Bioscience: Addressing the issues” is a collection of selected research papers presented at the International Conference on Advances in Biological Sciences (ICABS) organized by the Department of ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "fgtcdGIlbMc", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=s5h2MAEACAAJ&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": false, "country": "US", "textToSpeechPermission": "ALLOWED", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "NO_PAGES", "epub": {"isAvailable": false}, "accessViewStatus": "NONE"}, "id": "s5h2MAEACAAJ", "selfLink": "https://www.googleapis.com/books/v1/volumes/s5h2MAEACAAJ"}], "kind": "books#volumes"}