{"totalItems": 1, "items": [{"kind": "books#volume", "volumeInfo": {"publisher": "Springer Science & Business Media", "description": "Trustworthy Ubiquitous Computing covers aspects of trust in ubiquitous computing environments. The aspects of context, privacy, reliability, usability and user experience related to “emerged and exciting new computing paradigm of Ubiquitous Computing”, includes pervasive, grid, and peer-to-peer computing including sensor networks to provide secure computing and communication services at anytime and anywhere. Marc Weiser presented his vision of disappearing and ubiquitous computing more than 15 years ago. The big picture of the computer introduced into our environment was a big innovation and the starting point for various areas of research. In order to totally adopt the idea of ubiquitous computing several houses were build, equipped with technology and used as laboratory in order to find and test appliances that are useful and could be made available in our everyday life. Within the last years industry picked up the idea of integrating ubiquitous computing and already available products like remote controls for your house were developed and brought to the market. In spite of many applications and projects in the area of ubiquitous and pervasive computing the success is still far away. One of the main reasons is the lack of acceptance of and confidence in this technology. Although researchers and industry are working in all of these areas a forum to elaborate security, reliability and privacy issues, that resolve in trustworthy interfaces and computing environments for people interacting within these ubiquitous environments is important. The user experience factor of trust thus becomes a crucial issue for the success of a UbiComp application. The goal of this book is to provide a state the art of Trustworthy Ubiquitous Computing to address recent research results and to present and discuss the ideas, theories, technologies, systems, tools, applications and experiences on all theoretical and practical issues.", "language": "en", "publishedDate": "2012-09-08", "readingModes": {"text": false, "image": true}, "previewLink": "http://books.google.com/books?id=EIQnXpaZ3LYC&printsec=frontcover&dq=isbn:9491216708&hl=&cd=1&source=gbs_api", "title": "Trustworthy Ubiquitous Computing", "printType": "BOOK", "pageCount": 268, "maturityRating": "NOT_MATURE", "contentVersion": "preview-1.0.0", "industryIdentifiers": [{"identifier": "9789491216701", "type": "ISBN_13"}, {"identifier": "9491216708", "type": "ISBN_10"}], "imageLinks": {"smallThumbnail": "http://books.google.com/books/content?id=EIQnXpaZ3LYC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api", "thumbnail": "http://books.google.com/books/content?id=EIQnXpaZ3LYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}, "authors": ["Ismail Khalil", "Teddy Mantoro"], "allowAnonLogging": false, "infoLink": "http://books.google.com/books?id=EIQnXpaZ3LYC&dq=isbn:9491216708&hl=&source=gbs_api", "categories": ["Computers"], "canonicalVolumeLink": "http://books.google.com/books/about/Trustworthy_Ubiquitous_Computing.html?hl=&id=EIQnXpaZ3LYC"}, "searchInfo": {"textSnippet": "The goal of this book is to provide a state the art of Trustworthy Ubiquitous Computing to address recent research results and to present and discuss the ideas, theories, technologies, systems, tools, applications and experiences on all ..."}, "saleInfo": {"country": "US", "saleability": "NOT_FOR_SALE", "isEbook": false}, "etag": "Of+vzRQ86Cc", "accessInfo": {"webReaderLink": "http://books.google.com/books/reader?id=EIQnXpaZ3LYC&hl=&printsec=frontcover&output=reader&source=gbs_api", "publicDomain": false, "embeddable": true, "country": "US", "textToSpeechPermission": "ALLOWED_FOR_ACCESSIBILITY", "pdf": {"isAvailable": false}, "quoteSharingAllowed": false, "viewability": "PARTIAL", "epub": {"isAvailable": false}, "accessViewStatus": "SAMPLE"}, "id": "EIQnXpaZ3LYC", "selfLink": "https://www.googleapis.com/books/v1/volumes/EIQnXpaZ3LYC"}], "kind": "books#volumes"}